[
    {"http://www.norhamhigh.com/":"   Qualification Type GCSE

    Examination Board AQA
    
    
    
    Students learn to collaborate with others, think analytically and evaluate effectively. They gain the confidence to pursue their own ideas, reflect and refine their efforts. Whatever the future holds, students of GCSE Drama emerge with a toolkit of transferable skills, applicable both in further studies and in the workplace.
    
     
    
    
    What is the course like and what will be studied
    
    
    Students will explore Drama and theatre as a practical art form in which ideas and meaning are communicated to an audience through choices of form, style and convention.
    
    Students will create, perform and respond to Drama informed by their theoretical knowledge of drama and theatre.
    
    The subject content for GCSE Drama is divided into three components:
    
        Understanding Drama
    
        Devising Drama
    
        Texts in practice
    
    
     
    
    
    How will the course be assessed
    
    
    Component 1: Understanding drama
    
    The written paper constitutes 40% of the GCSE.
    
    
    Component 2: Devising drama
    
    Individual Devising Log and performance 40% of the GCSE.
    
    The Devising log is marked out of 60 and the individual performance is marked out of 20.
    
    
    Component 3: Texts in practice
    
    This component is a practical component in which students are assessed on their ability to apply theatrical skills to realise artistic intentions in live performance, and constitutes 20% of the GCSE.
    
    
    
    Future Options
    
    
    If you wish to continue studying Drama at a higher level, then studying GCSE Drama will prepare you for higher education such as A Level Drama. If you wish to pursue Drama as a career option then there are a number of routes that you can take such as acting, directing, teaching, stage management, costume design, set construction, lighting and sound technical work to name a few.
    
    
    
    
    "}
    {"https://www.clrchs.co.uk/","BTEC Level 2 Performing Arts is about learning how the dramatic process works, how to use dramatic technique to explore themes and issues and a playwright’s intention. It is also about how to create a character and perform using a variety of styles and genres. Students will explore a various script and devising techniques throughout the course.

    Students will be assessed on 3 units:
    
    Unit 1: Exploring the Performing Arts ( internally assessed)
    Unit 2: Developing Skills and Techniques for Performance (internally assessed)
    Unit 3: Performing to a Brief ( external assessment)
    
    Students will get the opportunity to attend theatre performances and workshops to further develop their skills."},
    {"http://www.brimsham.com/","At Brimsham Green School, Drama is a highly valued and popular subject across the key stages. 

    All students study this subject during Key Stage 3, where alongside learning technical skills and the basics of acting and theatre, we also see students develop in confidence, leadership skills and team work.  We give all students the opportunity to create drama, rehearse, watch and perform drama within a supportive and motivating environment.
    
    Students who continue to study the subject into GCSE and A Level find the course stimulating and enjoyable and relish the opportunity for independent learning.   They grow in their ability and desire to perform as the course progresses and our outcomes are very successful both in terms of grades and in what students have gained personally from the experience of studying Drama."},
    {"https://www.sandysecondaryschool.com/","Not only does Drama develop performance skills, a love of
    theatre and acting, harness confidence and the ability to
    lead and work in a team, it also develops presentation
    skills that are important in selling yourself as a young
    professional within both the initial interview processes as
    well as at further stages in your career. The cross-
    curricular links in regard to textual analysis enable and
    empower students to succeed in other areas of their
    school career, from both an understanding of politics and
    political and social structure, to their understanding of
    English literature.
    Course Units and Content:
    Component 1– Devising:
    • Create and develop a devised piece from a stimulus for
    performance. You can choose to be a performer or
    designer throughout this unit. You will complete a
    portfolio covering the creating and developing process
    and analysis and evaluation.
    The portfolio can be either....
    • handwritten/typed evidence between 1500–2000
    words
    • recorded/verbal evidence between 8–10 minutes
    • a combination of handwritten/typed evidence.
    Component 2– Performance from a Text:
    • You will either perform in and/or design for two key
    extracts from a performance piece. The choice of piece
    is up to you!
    Component 3– Theatre Makers in Practice:
    • Written examination on your practical exploration and
    study of one performance text (An Inspector Calls) and
    a live theatre evaluation (this year students had the
    opportunity to see ‘The Curious Incident of the Dog in
    the Night-Time in London’s West End).
    Assessment:
    Component 1: 40% of the qualification 60 marks
    Component 2: 20% of the qualification 48 marks
    Component 3: 40% of the qualification 60 marks"},
    {"https://www.biddenham.beds.sch.uk/","Two Specialist spaces for Drama and Theatre Studies, with purpose built raked seating, fully equipped with lighting rigs and sound systems. Break off areas for teaching and learning in theatrical design elements of courses (i.e makeup design, lighting, props and sound). A Dedicated Dance Studio with a sprung wooden floor , mirrors,  visual/ audio equipment  and  resource cupboard Fully resourced Music department, with independent practice rooms and a wide range of instrumental classes available. We go on theatre trips with every exam course to provide applied learning experiences. We have a rich and dynamic extra-curricular programme for all students (i.e. Musical, Drama Club, school productions, Touring Theatre Company and showcases). We have something for everyone. Drama encourages students to develop critical thinking skills, and become effective and independent learners. There is a strong focus on working imaginatively, collaborating creatively and communicating effectively. Students study all aspects of Drama and Theatre studies including devising, directing, and performing through practical and written work.   The departments offers extra curricular opportunities including a weekly drama club leading to involvement in the annual drama showcase (where students can also perform their GCSE and A-Level work), the school musical and theatre trips. The department has educational links to the college and university to provide workshops. GCSE – 100% pass rate for many years. GCSE Drama provides a solid foundation for further Drama studies and vocational opportunities. Students who have study Drama at GCSE have the opportunity to continue to study Drama and Theatre studies as an A level in 6th form. A-Level – 100% pass rate for many years.Students have continued to study Drama and Theatre studies at university and gain scholarships for acting schools (Bristol, Leicester and ALRA)."},
    {"http://www.budehaven.cornwall.sch.uk/","We believe that Drama is a vital and defining cultural art form. Throughout time, human beings have enacted events in order to help us make sense of the complex world we live in. We structure lessons that strike a balance between exploring process drama (learning by imagined experience) and product or skills based drama – the craft of theatre making. We develop schemes of work that provoke engagement and enthusiasm through our choice of theme and topic and apply early in our teaching the principles and assessment criteria that the exam boards recognise.
    Our lessons typically start with a starter or warm up, an introduction to the stimulus, a focusing convention or strategy that frames the whole group or small group work and an opportunity to create, perform and evaluate in a welcoming, safe and supportive studio environment."},
    {"https://www.aldercarhigh.co.uk/curriculum/","Do you have a passion for performance? Are you a budding actor, dancer or musician? Do you want
    to discover more about the fantastic roles behind the scenes – from costume design and make-up, to
    set design and lighting? You can choose the music, drama, dance or backstage projects as you com-
    plete this course.
    You will develop a range of skills which are attractive to employers, colleges and universities includ-
    ing: Communication, Confidence, Learning independently, Organisation, Problem solving, Research,
    Self-discipline, Stamina, Taking on responsibility and Time management..
    Music, Drama or combined pathways available."},
    {"http://www.beauchamps.essex.sch.uk","
    Year 8
    
    The students study play texts such as Willy Russell’s Blood Brothers. Drama skills and knowledge are expanded with an emphasis on creating atmosphere; this can be seen through our performance for purpose focus at the end of the year which incorporated script and film. Drama techniques are also developed through all topics and improvisation and movement sessions encourage students to use imagination when attempting to create dramatic meaning. We believe it is important to offer students a wide range of stimuli to work with and to engage them through variety and style.
    Year 9
    
    During this year students continue to develop communication skills through group discussions and practical development, but they also begin to investigate more challenging texts and themes through the process of Drama. Students look at the play text DNA by Dennis Kelly and explore the issues and challenges that can arise within peer groups. Students explore the text using a variety of drama techniques and then students confront and explore social issues and themes such as peer pressure and belonging. Throughout years 7,8 and 9 in addition to practical tasks there is an opportunity for students to gain experience with technical aspects of theatre and direction to ensure all aspects available where needed.
    GCSE
    
    The GCSE Drama course (Eduqas) is an active and diverse course which allows the students to expand their knowledge and understanding of theatre through a range of texts. The course introduces the students to different theatre styles and theatre practitioners, via a range of workshops. These workshops are the basis for Component 1 where they must devise their own piece of work for performance, create a portfolio detailing this process and then complete a written report evaluating the final performance. In Component 2 students study a text such as Blood Brother (Willy Russell), The Woman Who Cooked Her Husband (Debbie Issitt), Top Girls (Caryl Churchill) and then perform extracts from this to an external examiner. The final section is Component 3 which is a written examination based on a set text (DNA – Dennis Kelly) and live theatre review.
    
    Throughout the course students are given the opportunity to attend theatre trips to provide a resource for their live theatre evaluation and are presented with workshops by external companies to aid their development in specific performance styles. Key life skills learnt throughout the course will arm students with a variety of skills that employers are currently desperate for including professionalism, resilience and independence. We aim to develop inclusion for all and offer non-practical elements such as costume design for students who want to gain a wider understanding of the performing arts industry.
    "},
    {"https://www.haydonbridgehigh.co.uk/","Years 10, 11
    Dance and Drama
    
    QUALIFICATION: BTEC AWARD IN PERFORMING (DANCE 23095)
    AWARDING BODY: PEARSON EDEXCEL
    
    What will I learn?
    You will develop key skills that show your aptitude in performing arts such as reproducing repertoire or responding to stimuli. You will learn the process that underpins effective ways of working in the performing arts, such as development of ideas, rehearsal and performance. You will learn about the attitudes that are considered most important in the Performing Arts, including personal management and communication.
    
    How will I learn?
    You will work creatively in a group to shape and perform in a piece of live theatre and keep a record of your contributions to the devising process. This record will be part of your portfolio which will also include annotated sketches/photographs.
    You will learn about physical and interpretive skills by taking part in dance workshops and by watching professional dancers in live theatre performances.
    You will practically explore and research a range of dance pieces.
    You will take part in theatre visits, discuss what you have seen and learn how to write a performance review.
    
    How will I be assessed?
    
    Component 1: Exploring the performing arts (dance) Internal assessment [30%]
    Component 2: Developing skills and techniques Internal assessment [30%]
    Component 3: Responding to a brief Externally assessed [40%]
    
    Possible Careers/Future Pathways:
    BTEC in performing arts could lead on to further study in performing arts, theatre studies, and Expressive Arts at A-level and above, or other related subjects such as English, music, art and design. Career opportunities for students who study performing arts at a higher level include: the media, theatre, television, radio, the film industry, arts administration, drama therapy, education."},
    {"https://www.habsknights.org.uk/","Component 1: Understanding Drama
    • Section A – Roles in the theatre, stage spaces, terminology
    • Section B – Set text: Noughts and Crosses
    • Section C – Evaluation of live performance
    Component 2: Devising Drama – Devising an original performance from stimulus with a
    coursework portfolio and reflective evaluation – You can opt for the acting or technical pathway
    Component 3: Texts in practice Performance of 2 extracts of a scripted play – You can opt for
    the acting or technical pathway"},
    {"https://arkglobe.org/","Drama GCSE
    Exam Board: AQA
    Subject Leader: Ms Alonge
    What is the subject about?
    Drama GCSE is an opportunity for young
    people to explore challenging themes, topics
    and issues through performance. It allows
    students to grow in public speaking and builds
    effective team work over time.
    During the course students will be expected to study
    a variety of plays and explore a wide range of different
    theatre styles. During the course students will be expected to write theatre reviews
    and keep an extended diary of their practical work each lesson. This is used as a
    reflection to develop exam knowledge.
    Drama GCSE will help to develop practical skills, enhance imagination and explore
    creativity. Students will devise performances from topics or ideas suggested by the
    teacher or by the students themselves.
    Where will this qualification take me?
    Students will develop a multitude of skills, including collaboration, communication
    and an understanding of how to amend and refine work in order to make a smooth
    transition to the next level of study. Drama will give you the skills to present yourself
    in any type of business or organisation you choose.
    Candidates who study Drama go on to work in a range of jobs and careers from
    acting, stage and screen, to business and leadership. Roles involving writing plays are
    also possible.
    Course Components
    • Component 1: Understanding Drama (40%) Practical exploration and study
    of one set text and one live theatre review
    • Component 2: Devising (40%) Creating and developing a devised piece from a
    stimulus and performing this devised piece.
    • Component 3: Text in Performance (20%) Performing two key extracts from
    a performance text.
    "},
    {"https://www.habscrayford.org.uk/","BTEC Performing Arts
    Exam Board: Pearson Grade: Level 2
    The performing arts is a fantastic discipline to pursue if you are interested in developing
    confidence and skills in public speaking, group work, creativity, time management and
    leadership to name only a few. This qualification is for anyone with a passion for theatre, but
    you do not have to be an aspiring actor to reap the benefits of selecting BTEC Performing Arts
    as an option. This qualification builds upon skills and content primarily learnt during key
    stage 3 Drama lessons.
    Subject Content
    • Component 1: Developing Skills for Performance is our first assessment which will involve
    participating in workshops linked to practitioners. You will apply these skills to a scripted
    piece, performing to an invited audience.
    • Component 2: Exploring Performing Arts is our second assessment which will be a
    combination of coursework and practical work.
    • Component 3: Performing to a Brief is our third and final assessment which takes place in
    three areas; performance, coursework and a controlled assessment.
    Preparing for Success in Performing Arts
    To be successful students must be organised and manage their time well as there will be a
    number of deadlines to meet throughout the course. Students should also be willing to share
    their creative ideas as well as listen and respond to the suggestions made by others. It is vital
    that they are supportive of their peers and are ready to build new relationships and work
    closely with others.
    • Component 1: Developing Skills and Techniques in the Performing Arts- 30%
    The entire process will be documented through analytical and evaluative coursework.
    • Component 2: Exploring the Performing Arts- 30%
    This is a practical exploration of different performance styles and industry
    jobs chronicled through coursework culminating in an assessed presentation of
    your findings.
    • Component 3: Performing to a Brief- 40%
    An externally set task where you will work in groups of 3-7 to create a
    performance based on a set brief. Assessment is based on coursework, performance and
    an evaluative report written under controlled conditions.
    Future pathways
    Students will have a better understanding of whether the performing arts sector is for them.
    They may want to go on to further study such as A levels, BTECs or a mixture of both. Or
    students might want to find work in teaching, performing arts or as an apprentice or a trainee.
    "},
    {"https://ormistonpark.org.uk/","Students who study Creative and Performing Arts will learn how to use stimulus such as music, photographs, lyrics, and plays to create drama and bring performances to life with new techniques. You will learn how to use different drama mediums within your performance such as music and physical theatre. Studying Drama and Theatre Arts allows students to go on to study the subject at A-Level or as part of a BTEC in Performing Arts and then perhaps on to degree level. It can also help if you decide to continue into working in technical theatre or dance and music. Even if you decide you don’t want to continue studying the subject, Drama will help build your confidence and ensure that your skills in teamwork are well developed. This could help in careers such as law or government.

    Students will expect to develop a range of skills by studying CAPA such as:
    
        Working as a professional theatre company
        Creating and performing pieces in regular showcases.
        Producing rehearsal diaries, in-depth self-evaluations and working independently."},
    {"https://halifax.trinitymat.org/","

    What will I be studying?
    
    Year 1
    
    Acting: Performing texts
    
    Context: Understanding exactly how dialogue and conversation works, how this is reflected in good dramatic writing and how an actor ‘lifts’ such speech ‘off the page’ is important for those wishing to work in the theatre or as performers more widely. The ability to sight read competently and bring dialogue to life is essential for most television, film, radio, voice over and commercial work.
    
    Aims: To develop the skills necessary for analysing a piece of dialogue in dramatic writing and to be able to perform it appropriately.  To give learners practical experience in these skills, using both modern and classic texts.  The purpose of this unit is to enable learners to develop the skills to perform text appropriately.
    
    Year 2
    
    Live performance
    
    Context: Any aspiring professional performer will need to learn a variety of performance skills to perform in a way that will meet the expectations of their audience and also accurately represent them as performers. Beyond just performing effectively, performers need to think about the other performers, technical crew, performance, equipment, the expectations of the audience, quality and variety in the set and the practice and rehearsal schedule it takes to get to the final performance itself. Regularly having the opportunity to perform in front of an audience can help hone technique, expression and stage presence in order that high quality performance, and the practice required to get there, becomes second nature. Reflecting on performances is also a useful tool – as performers can see themselves through the audience’s eyes and learn more about how to develop their performance style to continually improve and grow in confidence.
    
    Aims: The aim of this unit is to give learners the opportunity to explore all the skills required for a live performance. These range from planning, rehearsing and the performance itself to the reflection required post-performance to ensure continual development as performers. By undergoing the process of preparing for a live performance, learners will have the opportunity to experience the variety of activities and skills required to bring a performance together.
    
    Year 9 RSL Acting:
    
    Careers – Career pathways in performing and directing theatre. Student experience visits from guest speakers and professional practitioners who deliver workshops from a range of cultures and backgrounds.
    
    Employability skills – Developing skills in research, recall and evaluation in order to refine and improve their practice.  Building confidence for independent learning and how to set and meet targets in a timely manner.
    
    Year 10 RSL Acting:
    
    Careers – Career pathways in performing and directing theatre. Student experience visits from guest speakers and professional practitioners who deliver workshops. Student are offered the opportunity to see live theatre and experience a range of cultures beyond Halifax.
    
    Employability skills – Equipping students with the knowledge to make decisions and justify choices, to be able to make mistakes and learn from them using a professional approach. Developing team work skills and learning about how respond to others behaviour when contributing to a wider common goal. In Performing Arts we open up opportunities to gain knowledge of types of employment and build upon useful IT and project management skills for future careers.
    
    How will I be assessed?
    
    Two units of study, one internal and one externally assessed
    
    50% each unit, 20 credits are required in total for level 2
    
    Each unit is assessed on their creating, performing and evaluating skills in context to the style.
    
    Which examination board am I following?
    
    Exam Board: RSL VQ
    
    Specification: Level 2 Tech Award in Creative and Performing Arts: Acting
    
    Website: www.rslawards.com/creative-performing-arts
    
    Which websites should I use to support my learning?
    
        http://thejohngodbercompany.co.uk/teechers/
        https://www.bbc.co.uk/bitesize/guides/zgvbgk7/revision/1 (A Christmas Carol)
        https://www.bbc.co.uk/bitesize/guides/zwmvd2p/revision/1 (Brecht & Epic Theatre)
        https://www.bbc.co.uk/bitesize/guides/zxn4mp3/revision/1 (Stanislavski & Realism Theatre)
        https://www.bbc.co.uk/bitesize/guides/ztfk6sg/revision/1 (DV8 & Physical Theatre)
        YouTube for various searching of repertoire including National Theatre at home
    
    "},
    {"https://www.wellington-school.co.uk/","Aim
    The aim of the course is to develop students’ ability to create, perform and respond to drama. In
    addition, students will explore performance texts and seek to understand their social, cultural and
    historical contexts. Throughout the two years, students will develop a range of theatrical skills and
    apply them to theatrical performance. Confidence in performance and communication are essential
    skills for this course.
    Grades Available
    1 - 9
    Outline of the Course
    Devising Drama: Students will be given a stimulus from which they must create a piece of drama.
    Students will create a portfolio to accompany the creative processes of this unit.
    Performance from text: Students will be given two extracts from a text which will be performed to,
    and externally marked by, a visiting examiner. An audience is required for this part of the course. A
    performance realisation document will also be written before the examiner arrives at the centre.
    Theatre Makers in Practice: The written exam is broken down into three sections. Section A consist of
    multiple choice question based on production. For section B of the exam, students will be given four
    questions which will be based on an unprepared extract from a text which students will have studied
    in depth. For section C, students will be given a question which will ask them to analyse and evaluate a
    piece of live theatre which the students will have seen.
    Examinations and Assessment
    Devising Drama: Non-Examined Assessment, 40% of the qualification, 80 marks. (20 marks for
    performance and 60 marks for the portfolio.)
    Performance from text: Non-Examined Assessment, 20% of the qualification, 40 marks. Externally
    assessed by visiting examiner.
    Theatre Makers in Practice: Written Examination: 1 hour 45 minutes, 40% of the qualification, 80
    marks. Open book.
    Further Study
    Drama offer a clear route into further and higher education for drama, performance and English-
    related courses. Career opportunities are numerous, for example, acting, presenting, stage managing,
    drama therapy and directing. In addition, students develop skills which support other further/higher
    education courses and career pathways. These include the ability to collaborate with others, think
    analytically and evaluate effectively."},
    {"https://www.bodmincollege.co.uk","Performing Arts: Drama
    AQA: GCSE Drama
    Course Outline
    YOU WILL DO WELL ON THIS COURSE IF...
    You apply a range of theatrical and dramatic techniques and skills to your own work.
    You apply Health and Safety rules to your preparation and practice.
    You are a critical yet constructive audience to the work of others.
    You are a positive and enthusiastic member of an ensemble and keep up to date with work.
    Your attendance and commitment are exemplary.
    We need you to show commitment and positivity at all times! You will not do well if you are absent
    frequently and are not prepared to work hard and generously with others.
    HOW IS THE COURSE ASSESSED?
    It is assessed both theoretically and practically with students taking part in Performances as well as
    completing a Written Exam at the end of Year 11. The course is delivered in 3 components:
    Component 1 – Understanding Drama – Written Exam (includes Set text and live theatre review)
    Component 2 – Devising Drama – Practical Performance with log book
    Component 3 – Texts in Practice – Practical Performance of 2 scripted extracts from a play
    COURSE OUTLINE
    WHAT IS GCSE DRAMA ALL ABOUT?
    GCSE Drama is designed to develop your understanding and awareness of live performance work. You will
    develop skills required for performing in front of a live audience and you will learn how to prepare both
    devised and scripted work. You will study a range of play texts as well as having the opportunity to
    experience as much live theatre as possible."},
    {"http://www.debenhamhighschool.suffolk.sch.uk/","This course is a new specification which brings...
    Clear and coherent structure –
    The qualification has a straightforward structure with three components, one that focuses on devising, one that focuses on performing in a
    performance from a text and one that focuses on practical understanding of a performance text.
    Practical focus – this new qualification focuses on the practical exploration of performance texts. The performance text that will be studied
    for the examination will require students to articulate how they would perform in certain roles, and direct and design for certain extracts,
    putting practical work at the heart of the qualification.
    Assessment
    Component 1: Devising
    Coursework
    40% of the qualification
    ● Create and develop a devised piece from stimulus (free choice for centre).
    ● Performance of this devised piece or design realisation for this performance.
    ● Analyse and evaluate the devising process and performance.
    Assessment overview
    ● Internally assessed and externally moderated.
    ● There are two parts to the assessment:
    1) a portfolio covering the creating and developing process and analysis and evaluation of
    this process
    2) a devised performance
    Component 2: Performance from Text
    Coursework
    20% of the qualification
    ● You will either perform in and/or design for two key extracts from a performance
    text.
    Assessment overview
    ● AO2 is assessed.
    ● Externally assessed by visiting examiner.
    Component 3: Theatre Makers in Practice
    Written examination: 1 hour 45 minutes
    40% of the qualification
    ● Practical exploration and study of one complete performance text
    ● Choice of eight performance texts
    ● Live theatre evaluation – free choice of production.
    Assessment overview
    Section A: Bringing Texts to Life
    ● This section consists of one question broken into five parts (short and extended responses) based on an unseen extract from the chosen
    performance text.
    Section B: Live Theatre Evaluation
    ● This section consists of two questions requiring students to analyse and evaluate a live theatre performance they have seen.
    Why choose this subject?
     You will enjoy this course if you want to study a subject that is both practical
    and creative.
     GCSE Drama follows on from drama work that you will have done already in
    Drama in Years 7-8. You will develop your improvisation and acting skills to a
    higher level.
     You will look at plays in more detail and look at different ways of bringing a
    script alive on stage.
     You get to explore different themes and issues through empathising with
    different opinions and viewpoints.
     You will get the opportunity to go on some theatre trips to extend your
    learning.
    What can you do next with this subject?
    You may wish to study Drama and Theatre Arts
    in more depth at A Level or a Level 3 Diploma in
    Performing Arts. The skills you learn through
    GCSE Drama are transferable to any industry as
    communication is a vital skill to develop for
    success in life."},
    {"http://www.brighouse.calderdale.sch.uk/curriculum/","Course Outline
    What do you do?
    GCSE Drama consists of 3 Units; Devising Drama, Text Performance and Performance and
    Response. Devising Drama focuses on responding to stimuli provided by the exam board and will
    lead to you creating an original piece of theatre and keeping a working portfolio of the process.
    Text Performance will require you to perform two extracts from a published play. The final unit
    will focus on how to bring a play from page to stage, (how you will bring the play to life for an
    audience) as well as reviewing a play that you will watch live at the theatre.
    Will it help me get a job?
    YES! Some people may be of the opinion that you don’t need drama for a particular job but it does
    relate to all of them! As well as learning about drama, students will also develop their personal
    and social skills. This includes;
     confidence
     team working skills
     presentation skills
     communication skills
     confidence
     team working skills
     presentation skills
     communication skills
    These are all really desirable skills that an employer will look for in their employee. It also looks
    really good on your CV which is the first point of contact when applying for jobs. The above skills
    are essential in any job.
    How will I be assessed?
    Devising Drama
    You will explore a stimulus provided by the exam board. You will
    work in groups to create your own devised drama based on your
    exploration.
    You will work as a performer creating a portfolio and a final
    performance.
    Non-
    examined
    assessment
    30%
    20%
    Portfolio
    10%
    Performance
    Presenting and Performing Texts
    You will explore a text and perform two scenes to a Visiting
    Examiner.
    You will work as a performer completing a pro forma and a final
    performance showcase.
    Non-
    examined
    assessment
    30%
    20%
    Performance
    10% Written
    pro-forma
    Drama: Performance and Response
    Section A contains questions based on the study of a full text from
    a list set by the exam board.
    Section B contains an extended response analysing and evaluating
    live theatre.
    Written
    Exam
    1½ hours
    40%
    Progression
    This course leads onto GCE Drama & Theatre Studies and/or BTEC Level 3 Acting.
    For more information please contact - Miss A Pickles, Mr C Hornsby & Miss R Venus
    "},
    {"https://www.walton-ac.org.uk/","GCSE drama

    Component 1 devising (40% of the qualification)
    
    You will work in a group to create and develop a devised piece of theatre from a stimulus given to you by your teacher. For example, this could be a newspaper article, song, picture or poem. Assessment of this unit will take two forms, your performance of the piece to an audience and a portfolio which covers the creating and developing process as well your analysis and evaluation of the process. The portfolio can either be a written document between 750 – 1000 words or a verbal presentation lasting between 8 – 10 minutes or a combination of the two.
    
    Component 2 performance from text (20% of the qualification)
    
    You will work in a group and develop, rehearse and perform two extracts from existing play texts which will be chosen by your teacher. This unit will be assessed by a visiting examiner. On the examination day you will perform your piece to an audience. You will gain marks for voice, movement, characterisation and communication within the performance.
    
    Component 3 theatre makers in practice (40% of the qualification)
    
    You will study one complete play text chosen by the centre. The exploration will take place through practical workshop sessions as well as theory based lessons. As part of this unit you will also go and see a live theatre performance and evaluate this as an audience member. Again, you will work on this in workshop sessions in class. The unit culminates in a written examination which is 1 hour and 30 minutes long. In the examination you will answer six question on an extract from the set play text you have studied and two questions on the live performance you went to see. You are allowed to take in 500 words of notes for the live evaluation section of the examination."},
    {"http://www.castlefordacademy.com","Aim:
    The GCSE in Drama is an exciting, inspiring and practical course. The specification
    promotes involvement in and enjoyment of drama, as performers and/or designers.
    Additionally, it provides opportunities to attend live theatre performances and to
    develop skills as informed and thoughtful audience members. This GCSE in Drama will
    enable learners to apply knowledge and understanding when making, performing and
    responding to drama.
    What will I learn?
    The course has 3 Components:
    Component 1 - Devising Theatre: You participate in the creation, development and
    performance of a piece of devised theatre in response to a set stimulus based on
    either the work of a theatre practitioner or a genre. You will then complete a written
    portfolio documenting the process and also an evaluation of your final performance.
    Component 2 - Performing from a Text: You will participate in two performances
    from a performance text of your own choice. This will then be performed to a visiting
    examiner.
    Component 3 - Interpreting Theatre: You will complete a written examination based
    on a set text studied and an evaluation of one live theatre production, seen during the
    course.
    How will I learn?
    You will learn on the course through practical exploration of set texts and stimuli,
    along with chosen scripts. This will be within workshops and rehearsals which then
    develop into final performances to invited audiences. The course requires you to work
    in groups, use your own initiative and demonstrate discipline thorough-out rehearsals.
    What homework can I expect?
    You will be expected to participate within research based on the performance/play
    being studied along with learning lines and performance preparation. You will also be
    required to complete written evaluations of practical work, live theatre reviews and
    written questions linked to set texts.
    Exam
    60%
    Internal Assessment
    40%
    Additional Requirements
    You will complete three units on the course. Two are externally marked and assessed
    and one is marked internally.
    Component 1 - Internally Assessed
    Component 2 - Practical performance of two chosen texts. Externally assessed (by
    visiting examiner)
    Component 3 - Written examination. Externally assessed
    What qualification will I get?
    GCSE in Drama"},
    {"http://www.stourvalleycommunityschool.org/","

    GCSE Drama follows the EDUQAS syllabus. The course requires students to work in a group to devise and create an original performance in the style of a theatre practitioner or genre they study in Year 10. The second element of the course requires students to prepare an extract of a published play (again, working in a group), and perform this to a visiting examiner during Year 11. The third and final aspect of the course is to sit a written exam focussing on a set text they have studied and explored practically throughout the two year course,as well as evaluate a live theatre performance they have seen throughout the course."},
    {"https://www.thehoward.org/","Why study Drama?
    You should study Drama if you enjoy:
    • participating in group work and leading others
    • practical work
    • having the opportunity to be creative and imaginative in devising your
    own work
    • exploring a variety of plays.
    You will gain a good knowledge and understanding of different practitioners,
    styles of drama and drama techniques, exploring how they are effective in
    performance.
    Assessment
    The course will cover
    The forms, styles, and contexts of drama and you will learn to work
    collaboratively to develop ideas, to express feelings, to experiment with
    technical elements and to reflect on your own and others’ performances.
    The course provides opportunities for you to attend professional
    performances and to develop your skills as informed and thoughtful
    audience members. You will be given opportunities to participate in and
    interpret your own and others’ drama. It promotes your involvement in and
    enjoyment of drama as performers, devisers, directors and designers. You
    can opt for this subject as an Acting candidate, but also a Design candidate
    where you can specialise in either lighting, sound or costume design.
    School contact Miss Hadley
    Exam board OCR
    Subject code J316
    Qualification number 601/8975/7
    Component Weighting Duration
    1 Devised performance 30% Performance
    2 Presenting and performing text 30% Performance
    3 Performance and response 40% 1 hour 30 mins"},
    {"https://www.astrea-longsands.org/","Course outline
    Throughout Year 10 students will work to recall
    some of the skills learnt in KS3 and develop an
    understanding of theatre practice. We will look at
    various practitioners and their work, and begin to use
    some of their theory within practical. Students will
    develop their understanding of Theatre of Cruelty,
    Naturalism, Epic Theatre, Theatre in Education and
    Physical Theatre. Students will have opportunity to
    develop their acting skills, as well as explore puppetry,
    mask work and theatre production. All students will
    be required to act throughout the length of the GCSE,
    and whilst there will be some elements of production
    and design (lighting & sound) this will not form a main
    focus.
    Is Drama for you?
    The course will demand that students are organised
    individuals who understand the requirement to learn
    lines alongside completing set homework tasks. Whilst
    it will not be every week, students will be expected to
    attend rehearsals out of the usual school day as per a
    set timetable as deadlines and examinations approach.
    Students will develop problem solving skills, the ability
    to think on the spot, and challenge their interpersonal
    skills. Opting for Drama will require students to be
    a team player with a want to contribute ideas, lead,
    challenge and develop."},
    {"http://www.bungayhigh.co.uk","Why study Drama?
    GCSE Drama will allow pupils to explore a range of drama as a practical art form, allowing pupils to create
    their own drama performances, study plays and evaluate the work of others. As well as developing
    confidence and knowledge you will also cultivate the following skills:
    * Acting skills
    * How to make informed artistic choices
    * Drama techniques and terminology
    * How to create and develop drama
    * Group work and collaboration skills
    * How to evaluate the work of others
    * Understand the dramatic potential of the text
    * Time management and problem-solving skills
    *How to write formally about texts and live performance
    What pathways does this subject lead to after Year 11?
    As well as being a perfect pathway for Drama/ Theatre and Performance courses, the confidence,
    presentational and analytical skills you will gain are transferable to many different areas. The broad nature
    of the course would also give students knowledge and skills to work in all areas of Theatre- design,
    technical, management as well as performance.
    How will you be assessed?
    Component 1: Devising Coursework 40%
    1) a portfolio covering the creating and developing process and analysis and evaluation
    of this process – this can be written or videoed.
    2) a devised performance/design realisation
    Component 2: Performance from Text Coursework 20%
    • Performance/design realisation covering both key extracts – visiting examiner
    Component 3: Theatre Makers in Practice 40 % - Written examination: 1 hour 45 minutes
    • Practical exploration and study of one complete performance text.
    • Live theatre evaluation – free choice of production.
    How can your parents/ carers help you with this course?
    Taking you see live theatre as much as possible!
    Exam board, specification and level of qualification
    Pearson Edexcel Level 1/Level 2 GCSE (9 - 1) in Drama (1DR0)
    Who is the contact in school for more information? Mrs Carnwell"},
    {"http://minsthorpe.cc","What is included in the course?
    The BTEC Acting course is a very practical
    course that explores the skills of an actor. You
    will train as an actor and participate in lots of
    staged performances to different audiences.
    The course relies heavily on you working and
    co-operating as part of a team as you will be
    staging a range of performances in groups
    including all the technical aspects of putting on
    a performance.
    The course consists of 3 components which are
    split up over the three years.
    They cover the following areas:
    • Exploring the Performing Arts industry
    • Presenting findings through a presentation
    • Developing acting skills and techniques
    • Performing devised and scripted plays
    • Participating in a variety of workshops
    • Performing to a brief
    • Performance styles
    • Professional repertoire
    How will I be assessed?
    Your work will be assessed both internally,
    by your teachers and externally, by the exam
    board. Assessed work will consist of the
    following:
    • Performance work
    • Presentations
    • Written logs
    • Portfolio work
    What grades are available?
    Course title - BTEC Level 2 Tech Award in
    Performing Arts: Acting
    Students can be awarded the following grades
    on the tech award and below is the equivalency
    to GCSE
    • Level 1 Pass - 1
    • Level 1 Merit - 2
    • Level 1 Distinction - 3
    • Level 2 Pass - 4
    • Level 2 Merit - 5/6
    • Level 2 Distinction - 7
    • Level 2 Distinction* - 8/9
    Possible next steps
    Students wanting to progress further with Acting
    Skills can go on to Level 3 or A Level course at
    college. Then go on to study a BA Hons Degree in
    Acting/Drama at University.
    Skills Developed
    • Confidence
    • Articulation
    • Pronunciation
    • Accent
    • Imaginative Skills
    • Devising
    • Vocal Expression
    • Movement Skills
    • Working from a Stimulus
    • Creative writing
    • Problem solving
    • Ability to realise ideas
    • Debate skills
    • Communication
    • Time management
    • Teamwork
    • Independence
    Career Opportunities
    • Actor - TV Film
    • Actor - Theatre Performer
    • Presenter
    • Artistic Director
    • TV Film Critic
    • Producer
    • Script Writer
    • Costume Designer
    • Lighting Technician
    • Sound Technician
    • Drama Therapist
    • Director
    • Production roles in theatre, TV and film
    • Theatre critic
    • TV critic
    • Teacher
    Curriculum Team "},
    {"https://www.williamhoward.cumbria.sch.uk/","If you enjoy Drama, Dance, Musical or Theatrical Theatre, this could be the course for you.
    The BTEC Technical Award is the equivalent
    of one GCSE.
    This course is focused on ‘Performance’ and
    offers a wide range of options in the three
    disciplines of Drama, Dance and Musical
    Theatre. You will gain experience of the
    understanding, knowledge and skills
    associated with practices and processes of
    the performing arts industry and acquire a
    general view of the variety of skills required
    for stage performance.
    There are 3 components to complete during the course:
    Component 1: Exploring the Performing Arts
    This is internally assessed. Learners will develop their understanding of the performing arts by examining
    practitioners’ work and the processes used to create performance.
    Component 2: Developing skills and technique in Performing Arts
    This is internally assessed. Learners will develop their performing arts skills and techniques through the
    reproduction of musical theatre repertoire.
    Component 3: Performing to a brief
    This is externally set and assessed by the examining body. Learners will be given the opportunity to work as
    part of a group to create a workshop performance in response to a given brief and stimulus.
    Students who take either GCSE Drama or the BTEC Technical Award in Performing Arts will be able to progress to
    A Level Drama and Theatre Studies or BTEC Nationals Level 3 Performing Arts courses that we offer in the Sixth
    Form"},
    {"http://www.wymondhamhigh.co.uk","The Eduqas GCSE Drama specification
    combines practical performance alongside
    a comprehensive introduction to theatre.
    It is an exciting, inspiring and practical
    course that promotes involvement in,
    and enjoyment of Drama, as performers
    and designers. Additionally it provides
    opportunities to attend live theatre
    performances and to develop skills
    as informed and thoughtful audience
    members.
    Course structure
    The course is divided into three main areas:
    Devising Theatre: Learners are assessed
    on either acting or design. They participate in
    the creation, development and performance
    of a piece of devised theatre using either
    the techniques of an influential theatre
    practitioner or a genre, in response to a
    stimulus set by the board.
    Learners need to produce the following
    for assessment:
    • A realisation of their piece of devised
    theatre
    • A portfolio of supporting evidence
    • An evaluation of the final performance
    or design
    Performing from a Text: Learners study two
    extracts from the same play and participate
    in a performance using sections from both
    extracts. They will be assessed on acting
    or design.
    Interpreting Theatre: A 90-minute written
    examination.
    Section A:
    Students answer a series of questions on the
    1989 play Hard to Swallow by Mark Wheeler.
    In preparation, learners will explore the text
    practically as a performer, designer and
    director.
    Section B:
    Learners answer one question, from a choice
    of two, requiring analysis and evaluation of
    a given aspect of a live theatre production
    seen during the course.
    Skills and knowledge you will need
    Drama is about creativity, communication
    and cooperation. It is a collaborative art
    form and throughout the course students
    will be required to create work as a team.
    Public performance is a requirement of
    the course, and all students will have an
    assessed performance every term. Drama
    develops your evaluative and analytical
    skills, encourages you to take risks and think
    beyond yourself, exploring a wide variety of
    contexts.
    Assessment
    Drama is assessed both practically
    and theoretically:
    • Devising Theatre (40% of GCSE)
    • Performing from a Text (20% of GCSE)
    • Interpreting Theatre (40% of GCSE)
    90-minute written examination
    Progression
    GCSE Drama is perfect preparation
    for A Level Drama and Theatre Studies;
    Vocational A Level in Performing Arts;
    BTEC National Certificate or Diploma
    in Performing Arts; Performance Design
    and Technology. Drama is also ideal
    preparation for any other A Level course
    that requires textual analysis, evaluation
    and interpretation of source material.
    Specification
    Awarding body and Specification Number:
    Eduqas (601/8420/6"},
    {"https://www.gumleyhouse.com","he course is suitable for students with a genuine interest in drama and theatre. You must enjoy group work and have
    excellent punctuality and attendance. Drama students should enjoy the challenge of practical drama work and be
    interested in learning about technical and design aspect of theatre. You will learn to write reflectively, analytically and
    creatively. You should be self-motivated and able to carry out independent research, complete detailed notes on practical
    sessions, homework and coursework tasks set, as well as organise and run rehearsals out of lessons.
    Will I enjoy the course?
    You will enjoy this course if you are prepared to work hard and you want to study a subject that is both practical and
    creative. You may have done some acting before or helped out backstage on a production. You may have always
    wanted to have a go directing a play, performing, making costumes, building a set or operating the lights but never
    had the chance. You will enjoy this course if you enjoy working as part of a team as drama involves a lot of group
    work. But be warned, it is not a soft option!
    What could I do next with GCSE Drama?
    DRAMA
    How does it follow on from what I have
    learned before?
    GCSE Drama follows on from drama work that you may have
    done at Key Stage 3. You will develop your improvisation
    and acting skills to a higher level. You can pursue theatrical
    design and technical options if those are your strengths. You
    will look at plays in more detail, both in the studio and at
    the theatre, and look at different ways of bringing a script to
    life on stage
    What about my results?
    As well as acquiring the skills involved in creating and
    performing drama, you will also be able to acquire skills in
    working with others, problem solving and communication.
    You will also find that drama will help you feel more self-
    confident and prepare you to deal with a range of different
    situations and people.
    What’s in the exam Specification?
    This exam is taken in the summer of Year 11
    Component 1: Devising Theatre
    Practical work– Internally assessed 60 marks/40%
    Learners devise a piece of original theatre in response
    to a stimulus using either acting or design.
    You will be required to produce a portfolio of
    supporting evidence of the rehearsal process and
    evaluate the final performance.
    Component 2 Performing from Text Practical work-
    externally assessed by visiting examiner 60 marks/20%
    Learners participate in the performance from a text
    assessed as either acting or designing
    Component 3:
    Written Paper – 1 hour 30mins – 60 marks 40%
    The written paper comprises three sections:
    A– Set Text – answer a series of questions related
    to performance of the set text studied. 45
    marks
    B– Live Theatre Review – an analysis and
    evaluation of a given performance aspect of a
    production seen. 15 marks
    24
    There are many things you can go on to do with a GCSE in Drama. If you are unsure about what to do next, the best
    thing to do is to speak to your drama teacher who will know about the choices on offer.
    You could go on to take an AS or Advanced GCE in Drama and Theatre Studies, or an Advanced Vocational Certificate
    of Education in Performing Arts or a BTEC National Certificate or Diploma in Performing Arts.
    You may wish to take a GCSE in Drama for its own sake, perhaps to form the basis of a future interest or as part of a
    range of other subjects. You might wish to use some of the skills developed during this course to enhance your
    career prospects, especially any career that involves meeting people face to face. The study of drama can help you
    develop transferable skills you can take into any career or job.
    Careers
    Drama provides you with the widest possible range of transferable skills of any subject. Drama can equip you for any
    profession where you need good communication skills, creative thinking, work as part of a team, analytical skills etc.
    Possible careers include: practising law; practising medicine; teaching; performing; directing; theatre administration;
    theatre design; sound and lighting technician; social worker; therapist; management training; education officer in
    theatres, art galleries, museums and other public institutions.
    Specific careers linked with Drama are: Theatre, TV and film work including performance, make-up, costume, set
    design, technical professions such as stage management, lighting and sound technicians, directors, producers, radio,
    multi-media, teaching, Drama Therapy and ANY career that requires good commitment, team work and presentation
    skill"},
    {"https://www.manningtreehigh.com","What is it?
    GCSE Drama is a highly appealing course due to the diverse range of activities,
    combining both practical and theoretical approaches to learning. GCSE Drama
    enables students to learn and hone a variety of dramatic skills and techniques
    whilst developing students’ knowledge of key dramatic genres. In addition to
    this, students will be given the opportunity to explore real life in a safe
    environment, preparing them for the wider world.
    Why should I take it?
    GCSE Drama nurtures the use of transferable skills such as communication,
    public speaking, analysis and evaluation, problem-solving and collaboration,
    research and decision making. These are all vital skills for the world of work,
    regardless of whether you intend to pursue further Drama qualifications or have
    an ambition to work in the creative industry post GCSEs. Such skills are also
    invaluable to the successful study of a huge range of A Level subjects, as well as
    those that can be studied at further and higher education institutes.
    What will I be studying?
    The course will aim for you to look at the many specialisms of drama, which will
    allow you to explore the subject in its entirety. The six key concepts explored
    through each of the three units of work are:
    - Character, context and plot
    - Structure
    - Audience and defining performance space
    39
    - Improvisation
    - Genre, performance, style and convention
    - Semiotics of Drama
    Key Course Features:
    ⮚ Creative approaches: Acting, devising and designing tasks appear
    throughout the course to suit a range of interests and skills
    ⮚ Themed projects where you can create and perform
    ⮚ Script work projects where you can bring to life and perform extracts from
    plays and then analyse and evaluate text in action
    ⮚ Written portfolios that allow you to reflect upon the process and evaluate
    Drama.
    ⮚ Live theatre witnessed and reviewed
    How is it assessed?
    ● Component 1: A devised performance and in addition an accompanying
    portfolio with evidence of the process, 30% of GCSE
    ● Component 2: A live performance or design from one text to a visiting
    examiner, 30% of GCSE
    ● Component 3: 1 Hour 30 mins written exam on the study of a set text and a
    review of a live performance, 40% of GCSE
    What else do I need to know?
    It is a requirement of the exam to see live performance so you should expect to
    attend the theatre at least once. Due to the nature of the course there is also
    an expectation that you will attend rehearsals for exam performances.
    GCSE Drama is an excellent starting point for further study at A Level and for
    University degree courses. Students of Drama develop creative skills, as well as
    knowledge and understanding of the Arts thus preparing them to study subjects
    such as: Performance Studies, Drama and Theatre Studies, Performing Arts,
    Media Studies, English Language and Literature, Philosophy, Sociology and
    Psychology, Dance, Music and Art.
    The study of GCSE Drama paves the way to a wide range of career possibilities,
    including those involved in public speaking and presenting, leadership and
    management, group co-operation and interaction, performing and
    communicating, teaching and learning, problem solving and investigation, and
    analysis and evaluation"},
    {"https://www.braunton.academy","This course will help you to become a confident performer and
    designer with the skills you need for a bright and successful future. These skills, both
    theatrical and transferable will help to expand your horizons.
    As part of the course you will:
    • Devise drama
    • Explore texts practically and work on two text-based performances
    • Choose to develop as a performer, designer (lighting, sound, set, costume, puppets).
    • Have the opportunity to attend at least two performances, one in school and one at
    a theatre, in each year of study.
    Method of Assessment:
    Understanding Drama - assessed as written exam, open book, 40%
    Devising Drama - devising log and devised performance, 40%
    Texts in Practice - performance of two extracts from one play as performer or designer,
    20%
    The written exam takes place at the end of the course, usually before other GCSE exams.
    The devising log and devised performance are marked by your teacher and then
    moderated. ‘Texts in Practice’ is marked by an external examiner.
    Future Study and Careers:
    Actor, arts administrator, drama teacher, drama therapist, television production assistant,
    radio presenter, theatre director, Youth and Community worker, personnel manager,
    social worker, journalist, marketing manager, charities administrator.
    Any profession in which confidence and the spoken word are important. Whatever the
    future holds, students of GCSE Drama emerge with a toolkit of transferable skills, applicable
    both in further studies and in the workplace.
    Our Students Say...
    “Drama is not just about acting, you can work backstage as well.”
    “It’s fun and you can express your feelings"}
]