[
    {
        "http://www.norhamhigh.com/":"Qualification Type	GCSE

        Examination Board	OCR
        
        GCSE Computer Science is for all students who wish to understand the deeper workings of a computer. Computing is at the forefront of almost every company and business. Being able to understand how computers work with the knowledge of how to program them will give you a head start to everyone else. 
        
        
        What is the course like and what will be studied
        
        This course builds on knowledge and understanding from KS3 units of study. Students will continue to develop their understanding of computer science and knowledge of computer programming. Within the course students will use and develop a number of skills, such as logic and reasoning that they will be able to use across other GCSE subjects and take with them into higher education.
        
        
        Component 01: Computer systems
        
        Introduces students to the central processing unit (CPU), computer memory and storage, data representation, wired and wireless networks, network topologies, system security and system software. It also looks at ethical, legal, cultural and environmental concerns associated with computer science.
        
        Component 02: Computational thinking, algorithms and programming
        
        Students apply knowledge and understanding gained in component 01. They develop skills and understanding in computational thinking: algorithms, programming techniques, producing robust programs, computational logic and translators.
        
        Practical programming
        
        Students are to be given the opportunity to undertake a programming task(s) during their course of study which allows them to develop their skills to design, write, test and refine programs using a high-level programming language. Students will be assessed on these skills during the written examinations, in particular component 02 (section B). 
        
        
        How will the course be assessed
        
        Paper 1 - Computer Systems - 1 hour 30 min’s Exam - 50%
        
        Paper 2 - Computational thinking, algorithms and programming - 1 hour 30 min’s Exam - 50%
        
        
        Future Options
        
        With taking GCSE Computer science students will be able to transition seamlessly into Computer Science at AS Level and/or A Level. 
        
        This GCSE course will enable students to develop valuable thinking and programming skills that are extremely attractive in the modern workplace and gain a deep understanding of computational thinking and how to apply it through a chosen programming language.
        
        
        "
    }
    {"https://www.clrchs.co.uk/","Two courses are offered to enable students to explore different aspects of ICT and Computing.

    GCSE Computing – This new exciting course gives learners the opportunity to investigate and gain an in-depth understanding into how computers work, and how they are used.
    
    Creative Media – This course offers learners the opportunity to study a diverse range of media topics, including video editing, camera operation, Sound editing, graphic design and media production. Please note, this course is for the beginner to intermediate students and is suitable for those who have no experience in the field of media production."},
    {"http://www.brimsham.com/","Computing and ICT The creative study and use of both Computing and ICT at Brimsham Green aims to provide pupils with a high quality of learning and achievement at all levels in:

    • The ability to critically evaluate and assimilate the information they encounter, particularly through sources such as the internet
    
    • An appreciation of the role that computing and IT plays in the world around them.
    
    • An understanding of the need to practice e-safety when using IT resources, particularly online.
    
    • The role computing and ICT plays in businesses
    
    • To reinforce a cross-curricular approach to computing and ICT - students should encounter both in a wide range of contexts and not exclusively through the study of computing itself
    
    • To emphasise access - Children should have frequent access to ICT tools and have adequate opportunity to use these tools when it is appropriate to do so
    
    The study of computer science, at all key stages, encourages students to develop an appreciation and understanding of the impact that developments in information technology have on themselves, communities worldwide, and the future. It also helps emphasizes the growing importance attributed to the communication aspects of new technologies which students are so keen to engage with nowadays. Consequently, studying computer science and ICT will contribute in a significant way to the general education of pupils, whether or not they intend proceeding to further studies or employment specific to information technology."},
    {"https://www.sandysecondaryschool.com/","Over 2 years learners will be encouraged to:
    • Understand and apply the fundamental
    principles and concepts of Computer Science,
    including abstraction, decomposition, logic,
    algorithms, and data representation
    • Analyse problems in computational terms
    through practical experience of solving such
    problems, including designing, writing and
    debugging programs
    • Think creatively, innovatively, analytically,
    logically and critically
    • Understand the components that make up
    digital systems, and how they communicate
    with one another and with other systems
    • Understand the impacts of digital technology
    to the individual and to wider society
    • Apply mathematical skills relevant to Computer
    Science"},
    {"https://www.biddenham.beds.sch.uk/","Department Information

    A friendly, supportive and creative learning environment.
    Dedicated air conditioned computer suites with interactive whiteboards and specialist software.
    An inclusive approach to teaching and learning where all students will feel valued.
    High expectations of all students.
    A wide variety of course options allowing students to tailor their education to meet their own requirements.
    Opportunities to learn outside of the classroom including trips to the National Computing Museum.
    Specialist teachers with a proven passion for delivering skills pertinent for many years down the line.
    Lunchtime and after-school clubs in application development and robotics.

Curriculum Support

Technology is ubiquitous in our modern society. Everything from mobile phones, televisions, traffic lights, theme parks, agriculture to sport depend on technology. You need to be prepared for the digital world.

 

The computing syllabus will give you an in-depth understanding of how computer technology works and a look at what goes on ‘behind the scenes’. As part of this, a large amount of the course will be spent learning computer programming. Through this study of computer programming, the course will help you develop critical thinking, analysis and problem solving skills. For many, it will be a fun and interesting way to develop these skills, which can be transferred to other subjects, especially mathematics and other sciences, and even applied in day-to-day life.

It is a fact that information technologies continue to have a growing importance. This means there will be a bigger demand for professionals who are qualified in this area. If you want to go on to higher study and employment in the field of computer science, you will find that this course provides a superb stepping stone. Students who have taken a Computing GCSE and who then progress to study the subject at A Level or university will have a sound underpinning knowledge of this area. We offer Computer Science at both KS4 and KS5. "},
    {"http://www.budehaven.cornwall.sch.uk/","At KS4 students are given the option to choose GCSE Computing if they wish to continue their studies in this subject."},
    {"https://www.aldercarhigh.co.uk/curriculum/","The Pearson BTEC Tech Award in Digital Information Technology is for students who want to
    acquire technical knowledge and technical skills through vocational contexts by studying the
    knowledge, understanding and skills related to data management, data interpretation, data
    presentation and data protection as part of their Key Stage 4 learning. The qualification will
    broaden the learners’ experience and understanding of the varied progression options
    available to them"},
    {"http://www.beauchamps.essex.sch.uk","COMPUTER SCIENCE GCSE

    Examination Board: OCR (Syllabus Number J277)
    
    Why should I pick this and what will I study?
    
    This qualification has been created to get students working with real-world programming and provides a good understanding of the fundamental principles of computing.  Employers are increasingly looking to recruit programmers who are proficient in the Python programming language which we use here at Beauchamps to deliver the course.  The syllabus been designed to assess candidates’ achievement through external exams.
    
    The areas covered by the external exam are:
    
        System Architecture
        Memory and Storage
        Computer Networks, connections and protocols
        Network Security
        System Software
        Ethical, Legal, Cultural and Environment impact of Digital Technology
        Algorithms
        Programming Fundamentals
        Producing Robust Programs
        Boolean Logic
        Programming Languages and Integrated Development Environments
    "},
    {"https://www.haydonbridgehigh.co.uk/","Years 10, 11

    QUALIFICATION: Creative iMedia Level 1/2 Certificate
    AWARDING BODY: OCR Cambridge National
    
    What will I learn?
    You will learn about how to plan preproduction effectively and use this knowledge in the optional units when you develop your own media products. You will learn the basics of digital graphics editing for the creative and digital media sector, considering client requirements. You will follow a client brief to plan and create a digital animation using appropriate animation, and then review the final product.
    
    How will I learn?
    You will participate in a variety of learning approaches including problem solving, hands-on computer access and responding to individual assessment feedback. You will also learn through whole class discussion, paired work and individual practice.
    
    How will I be assessed?
    Mandatory Units
    R081 – Pre Production Skills Written paper, 1 hour 15 minutes – 60 Marks
    R082 – Creating Digital Graphics Centre assessed task, OCR moderated – 60 Marks
    R086: Creating a digital animation Centre assessed task, OCR moderated – 60 Marks
    R087: Creating interactive multimedia products Centre assessed task – 60 Marks
    
    Possible Careers/Future Pathways:
    This qualification’s hands-on approach has strong relevance to the way young people use the technology required in creative media and prepares students for studying ICT at A-Level and the workplace. The ability to analyse and design systems that are used in the workplace, the ability to see relationships and the broader perspective will all be important and marketable skills for future employment."},
    {"https://www.habsknights.org.uk/","Component 1: Computer Systems
    Component 2: Computational thinking, algorithms and programming
    Programming Project"},
    {"https://arkglobe.org/","Computer Science
    GCSE
    Exam Board: OCR
    Subject Leader: Mr Kolawole
    Entry Requirement: Grade 6 or better
    What is the subject about?
    Computer Science GCSE inspires students to engage
    with developments in technology with topics ranging
    from computer communications and networking to
    application development.
    Computer Science encourages learners to:
    • understand Computer Science - abstraction, decomposition, logic, algorithms, and data
    representation
    • analyse and solve computational problems, including designing, writing and debugging
    programs
    • think creatively, innovatively, analytically, logically and critically
    • apply mathematical skills relevant to Computer Science.
    Where will this qualification take me?
    Computer Science prepares students for a varied future in technology from working with
    drones and driverless cars to programming and data analysis. The GCSE also develops
    an understanding of the A level and university degree course, opening up a vast array of
    exciting technical careers in fields that are still emerging.
    Many traditional jobs are being replaced by jobs that require automation based on
    Computer technology. There are no limits to what the future holds for Computer
    Scientists. This is a cutting edge qualification.
    Course Components:
    Computer systems (50%)
    • Systems Architecture, Memory & Storage
    • Wired and wireless networks
    • Networks, System security & System software
    • Ethical, legal, cultural and environmental concerns
    Computational thinking, algorithms & programming (50%)
    • Algorithms
    • Programming techniques
    • Producing robust programs
    • Data representation"},
    {"https://www.habscrayford.org.uk/","30
    GCSE Computer Science
    Exam Board: OCR Grade: 9-1
    This is the study of the theory, and practical that forms the basis for the design and use of
    computers. If you are interested to know what happens inside a computer and the
    programming that helps it run, then this might be the right course for you. This qualification
    builds upon skills and content primarily learnt during key stage 3 IT lessons.
    Subject Content
    The course is made up of two components:
    Component 01: Computer systems
    Introduces students to the central processing unit (CPU), computer memory and storage, data
    representation, wired and wireless networks, network topologies, system security and system
    software. It also looks at ethical, legal, cultural and environmental concerns associated with
    computer science.
    Component 02: Computational thinking, algorithms and programming
    Students apply knowledge and understanding gained in component 01. They develop skills
    and understanding in computational thinking: algorithms, programming techniques,
    producing robust programs, computational logic and translators.
    Practical programming
    Students will be given the opportunity to undertake a programming task(s) during their course
    of study which allows them to develop their skills to design, write, test and refine programs
    using a high-level programming language. Students will be assessed on these skills during the
    written examinations, particularly in component 02 (section B).
    Assessment
    The course is assessed by two written exams:
    Component 01: Computer Systems (1 hour 30 minutes written paper) No calculators allowed
    Component 02: Computational thinking, algorithms and programming (1 hour 30 minutes
    written paper) No calculators are allowed.
    Future Pathways
    This qualification can lead to A Level in Computer Science, vocational IT qualifications and the
    following careers: Software Engineering, Computer Systems Analyst, Teacher, Computer
    Programming, Software Development and Web Development"},
    {"https://ormistonpark.org.uk/","
    ICT
    
    ICT has become a crucial part of our everyday lives. We are living in a world where technology is evolving rapidly, creating new subject areas to explore and changing the way people work in every area, from medicine and fashion to engineering and economics. So whatever your career plans, you know it’s vital to develop your grasp of these ideas and concepts that will shape your world. ICT will help you think logically, solve puzzles and be tenacious when the going gets tough. But it is also really creative and you’ll get a real buzz out of getting something to work yourself. It’s no exaggeration to say the world runs on computers. They are everywhere: in homes, schools and offices but not just in the way you think. They are also embedded in all sorts of machines. Computers control aeroplanes, chemical plants, send rockets to space, control the central heating and make sure your mum/dad’s car runs efficiently. As new things are developed, the world needs more and more people to research new ways of using computers to do the things they want. ICT will provide you with a great foundation to take your passion for computing further to help you pursue a career in any of those areas mentioned."},
    {"https://halifax.trinitymat.org/","

    What will I be studying?
    
        J277/01: Computer systems
            1 .1 Systems architecture
            1.2 Memory and storage
            1.3 Computer networks, connections and protocols
            1.4 Network security
            1.5 Systems software
            1.6 Ethical, legal, cultural and environmental impacts of digital technology
        J277/02: Computational thinking, algorithms and programming
            2.1 Algorithms
            2.2 Programming fundamentals
            2.3 Producing robust programs
            2.4 Boolean logic
            2.5 Programming languages and Integrated Development Environments
    
    Career Links
    
    Year 10
    
    Careers – Career pathways in Network Roles, Teacher Roles, Web Design Developer, Games Designer Developer, Data Analyst, Cyber Security Analyst/Consultant, Information Systems Managers, Database Administrator, Technical Writer, Data Scientist, Software Tester, Software Engineer and programmer.
    
    Employability skills – analyse and critically evaluate information, effective communicators, team work, Proficiency with programming languages, Mathematical skill ,Problem-solving capability, Communication skills and Writing skills
    
    Year 11
    
    Careers – Career pathways in Network Roles, Teacher Roles, Web Design Developer, Games Designer Developer, Data Analyst, Cyber Security Analyst/Consultant, Information Systems Managers, Database Administrator, Technical Writer, Data Scientist, Software Tester, Software Engineer and programmer.
    
    Employability skills – analyse and critically evaluate information, effective communicators, team work, Proficiency with programming languages, Mathematical skill ,Problem-solving capability, Communication skills and Writing skills.
    
    How will I be assessed?
    
        J277/01: Computer systems
            Written paper: 1 hour and 30 minutes
            50% of total GCSE
            80 marks
            This is a non-calculator paper
            All questions are mandatory
            This paper consists of multiple choice questions
            Short response questions and extended response questions
        J277/02: Computational thinking, algorithms and programming
            Written paper: 1 hour and 30 minutes
            50% of total GCSE
            80 marks
            This is a non-calculator paper
            This paper has two sections: Section A and Section B. Students must answer both sections
            All questions are mandatory
            In Section B, questions assessing students’ ability to write or refine algorithms must be answered using either the OCR Exam Reference Language or the high-level programming language they are familiar with
    
    Which examination board am I following? 
    
    Exam Board: www.ocr.org.uk/gcsecomputerscience
    
    Specification: https://ocr.org.uk/qualifications/gcse/computer-science-j277-from-2020/
    
    Website: www.ocr.org.uk/gcsecomputerscience
    
    Which websites should I use to support my learning?
    
        https://www.learnpython.org/
        https://www.bbc.co.uk/bitesize/examspecs/zmtchbk
        https://sites.google.com/horburycomputing.co.uk/gcse-computing/home
    
    "},
    {"https://www.wellington-school.co.uk/","Aim
    The incredible developments in computer technology over recent years have led to an explosion of
    computer usage by businesses and home users. We live in an increasingly digital world where the
    use of computers is inescapable. Computer Science aims to give those who study it a deep
    understanding of how computer systems work. It empowers students to be creators of applications,
    rather than passive consumers of technology.
    Grades Available
    1 - 9
    Outline of the Course
    1. Fundamentals of algorithms: how computers search and sort data.
    2. Programming: Writing computer code to follow planned algorithms.
    3. Fundamentals of data representation: How all data (text, images and sound) can be
    represented by binary code.
    4. Computer systems: The hardware and software components that make a computer.
    5. Fundamentals of computer networks.
    6. Fundamentals of cyber security.
    7. Relational databases and structured query language.
    8. Ethical, legal and environmental impacts of digital technology on wider society.
    Examinations and Assessment
    Paper 1: Computational thinking and programming skills (2 hour paper-based examination). This
    component is worth 50% of the final GCSE grade and assesses code tracing, problem solving,
    programming concepts and algorithm design as well as theoretical knowledge of computer science
    from subject content 1 and 2 above.
    Paper 2: Computing Concepts (1 hour and 45 minute paper-based examination). The second paper is
    also worth 50% of the final grade and assesses theoretical content from subject content 3-8 above.
    Further Study
    Computer Science GCSE supports further study in Computer Science A-Level or vocational
    equivalents. Students can then progress to courses at university such as systems engineering,
    software engineering and artificial intelligence. Career prospects in the computing industry are wide
    ranging. Other than for those who aspire to work in the computer industry, there are many others
    who may choose Computer Science. Study of the subject supports progress in Science, Technology,
    Engineering and Mathematics. It develops transferable skills, particularly logical thinking and
    problem solving.
    Key Stage 4 Curriculum Booklet
    D&T Design & Technology (Product
    Design)
    Exam Board
    Syllabus Number
    AQA
    8552
    Aim
    GCSE Design and Technology is an exciting and creative course that will prepare students to
    participate confidently in an increasingly technological world. Students will gain awareness and
    learn from wider influences on Design and Technology, including historical, social, cultural,
    environmental and economic factors. Students will get the opportunity to become creative and
    critical thinkers, developing skills to design and apply practical expertise to make products that solve
    real and relevant problems.
    Grades Available
    1 - 9
    Outline of the Course
    GCSE Design and Technology focuses on core technical, designing and making principles, including
    a broad range of design processes, materials techniques and equipment. Students will then study
    specialist technical principles in greater depth in Product Design.
    • Core technical knowledge of Design and Technology principles
    • Specialist technical principles.
    • Designing and making principles.
    Examinations and Assessment
    Students will be required to produce one non examination assessment which will account for 50%
    of the final GCSE grade.
    Non Examination Assessment 100 marks Approximately 40 hours
    Students undertake a substantial design and make task where needs and requirements are identified
    through investigation. Design solutions are created to meet those needs and prototype products are
    manufactured and evaluated. All work is will be presented in a design portfolio.
    A final examination will provide the remaining 50% of the total GCSE grade.
    Written Examination 100 marks 2 hours
    Further Study
    Following the successful completion of GCSE Design and Technology, and depending on the specialist
    route they have followed: students can go on to study 'A' Level Product Design or Graphic
    Communication. It also provides the knowledge and practical skills that would benefit further study
    or employment in many areas such as Graphic Design, Website Design, Packaging Design, Video Game
    Design, Interior Design, Architecture, Construction and Civil Engineering to name a few!
    Key Stage 4 Curriculum Booklet
    Drama Exam Board
    Specification code
    AQA
    8261
    Aim
    The aim of the course is to develop students’ ability to create, perform and respond to drama. In
    addition, students will explore performance texts and seek to understand their social, cultural and
    historical contexts. Throughout the two years, students will develop a range of theatrical skills and
    apply them to theatrical performance. Confidence in performance and communication are essential
    skills for this course.
    Grades Available
    1 - 9
    Outline of the Course
    Devising Drama: Students will be given a stimulus from which they must create a piece of drama.
    Students will create a portfolio to accompany the creative processes of this unit.
    Performance from text: Students will be given two extracts from a text which will be performed to,
    and externally marked by, a visiting examiner. An audience is required for this part of the course. A
    performance realisation document will also be written before the examiner arrives at the centre.
    Theatre Makers in Practice: The written exam is broken down into three sections. Section A consist of
    multiple choice question based on production. For section B of the exam, students will be given four
    questions which will be based on an unprepared extract from a text which students will have studied
    in depth. For section C, students will be given a question which will ask them to analyse and evaluate a
    piece of live theatre which the students will have seen.
    Examinations and Assessment
    Devising Drama: Non-Examined Assessment, 40% of the qualification, 80 marks. (20 marks for
    performance and 60 marks for the portfolio.)
    Performance from text: Non-Examined Assessment, 20% of the qualification, 40 marks. Externally
    assessed by visiting examiner.
    Theatre Makers in Practice: Written Examination: 1 hour 45 minutes, 40% of the qualification, 80
    marks. Open book.
    Further Study
    Drama offer a clear route into further and higher education for drama, performance and English-
    related courses. Career opportunities are numerous, for example, acting, presenting, stage managing,
    drama therapy and directing. In addition, students develop skills which support other further/higher
    education courses and career pathways. These include the ability to collaborate with others, think
    analytically and evaluate effectively.
    Key Stage 4 Curriculum Booklet
    Technical Award in Information
    Technologies
    Exam Board
    Syllabus Number
    OCR
    J808
    Aim
    Modern life is influenced like never before by digital data. It is impossible to go through a single day
    without interacting with a system that makes use it. Our society relies on it to function correctly. The
    generation and analysis of data will be the key to solving some of the greatest challenges facing
    humanity, such as global warming, generating new antibiotics and how to meet the needs of an
    aging and expanding population. Studying the Cambridge National in Information Technologies will
    teach students how data is gathered, analysed, communicated and presented. They will learn about
    the software, hardware and techniques used in data management projects.
    Grades Available
    Distinction *, Distinction, Merit, Pass at Level 1 and 2
    Outline of the Course
    1. Understand the tools and techniques that can be used to initiate and plan data management
    solutions – project planning.
    2. To be able to initiate and plan a solution to meet an identified need – project management.
    3. Understand how data and information can be collected, stored and used.
    4. Understand the factors to be considered when collecting and processing data and storing
    data/information – protecting data from hackers and malware, the legal framework around
    data and ensuring it is reliable.
    5. To be able to import and manipulate data to develop a solution to meet an identified need –
    use of spreadsheet and database software.
    6. Understand the different methods of processing data and presenting information.
    7. To be able to select and present information in the development of the solution to meet an
    identified need.
    8. To be able to iteratively review and evaluate the development of the solution.
    Examinations and Assessment
    Exam: Understanding tools, techniques, methods and processes for technological solutions. This
    component is worth 50% of the final grade and assesses content from topics 1, 3, 4 and 6 above.
    Project: Developing technological solutions. A 20-hour project which assesses students’ ability to
    plan a project and gather, manipulate and present data. This covers topics 2, 5, 7 and 8 above.
    Further Study
    The skills, knowledge and understanding students will develop through this qualification are very
    relevant to both work and further study. They will support them in a range of subject areas such as A
    Levels in Business and Computer Science or vocational IT qualifications. They can also support their
    progression into employment through Apprenticeships in areas such as Digital Marketer or Business
    Administrator.
    Key Stage 4 Curriculum Booklet
    Media Studies Exam Board
    Syllabus Number
    OCR
    J200
    Aim
    GCSE Media Studies makes understanding the media industry interesting, challenging and creative.
    It offers rigorous but accessible learning on a subject of key importance for young peoples’
    understanding of the world they experience. The course offers extensive coverage of media theory
    and practice, creating opportunities to learn about real media products and industries.
    Grades Available
    1 - 9
    Outline of the Course
    Component 01: Television and promoting media
    • In Section A: Television, students engage with an in-depth study of one contemporary and
    one historic television product, responding to questions covering the whole of the
    theoretical framework and a range of media contexts
    • In Section B: Promoting media, students study media products from the same global
    conglomerate producer illustrating the media forms of film, advertising and marketing, and
    video games.
    Component 02: Music and news
    • In Section A: Music, students engage with one in-depth study covering magazines, a
    comparative study of music videos and a study of contemporary radio.
    • In Section B: News, students engage with one in-depth study of online news, including its
    social and participatory media. Students also study contemporary and historical newspaper
    front pages and how they illustrate changing social, cultural, historical and political contexts.
    Component 03: Creating media
    • Students apply their knowledge and understanding of media language and representations
    to create media products of their own, using the theoretical framework to express and
    communicate meaning to an intended audience
    Examinations and Assessment
    • Component One: Written examination, 1hr 45minutes (35%)
    • Component Two: Written examination, 1hr 15minutes (35%)
    • Component Three: Non Examined Assessment (30%)
    Further Study
    GCSE Media Studies leads directly into Media Studies A-Level. It also complements A-Levels in
    English Language and Literature, English Literature, Art and Design and Graphic Communication.
    Key Stage 4 Options
    Music Exam Board
    Syllabus Number
    Eduqas
    C660QS
    Aim
    Studying music at GCSE allows students to continue developing skills from Key Stage 3, with the
    study of music from different musical periods and genres. They also have to participate in musical
    performances, either through the use of music technology, playing instruments or singing; as well as
    being given the opportunity to learn about the recording progress. Compositional skills are also
    taught in a traditional sense, using notation as well as using different software to create electronic
    music. The course also gives students the opportunity to develop broader life skills, including critical
    and creative thinking, cultural understanding, self-discipline, self-confidence and self-motivation.
    Grades Available
    1 - 9
    Outline of the Course
    The course is split into 3 units: Performing; Composing; and Appraising. The 3 disciplines are taught
    and developed around the study of 2 set works and non-familiar music from 4 different areas of
    study: Musical Forms and Devices; Music for Ensemble; Film Music; Popular Music.
    Examinations and Assessment
    Unit Assessment Type Date of
    completion
    Duration Weighting
    1. Performing Non-examined assessment December 2022 N/A 30%
    2. Composing Non-examined assessment March 2023 N/A 30%
    3. Appraising Written examination May 2023 1h 15m 40%
    Further Study
    The GCSE in Music leads directly in to the Music or Music Technology A-Level. Students will have
    enough technological and musical knowledge and experience to continue developing their skills at A-
    Level.
    Key Stage 4 Curriculum Booklet
    Sociology Exam Board
    Syllabus Number
    AQA
    8192
    Aim
    GCSE Sociology helps students to gain knowledge and understanding of key social structures,
    processes and issues through the study of families, education, crime and deviance, and social
    stratification.
    Students will develop their analytical, assimilation and communication skills by comparing and
    contrasting perspectives on a variety of social issues, constructing reasoned arguments, making
    substantiated judgements and drawing reasoned conclusions.
    By studying sociology, students will develop transferable skills including how to:
    • investigate facts and make deductions
    • develop opinions and new ideas on social issues
    • analyse and better understand the social world.
    Grades Available
    1 - 9
    Outline of the Course
    Module of Study What will be covered
    Paper 1: The sociology of families
    and education
    The sociology of families
    The sociology of education
    Relevant areas of social theory and methodology
    Paper 2: The sociology of crime and
    deviance and social stratification.
    The sociology of crime and deviance
    The sociology of social stratification
    Relevant areas of social theory and methodology
    Examinations and Assessment
    Paper 1: The sociology of families and
    education One hour and 45 mins. 100 marks. 50%
    Paper 2: The sociology of crime and
    deviance and social stratification. One hour and 45 mins. 100 marks. 50%
    Further Study
    After studying this GCSE, students will have the foundation required to commence an A-Level course
    in Sociology. The skills and content within the GCSE also offer an excellent base for studying A-level
    subjects such as Psychology, politics, History, Religion and Philosophy and other Social Science based
    subjects. Career opportunities are vast; for example, Social Policy, Public Services, Media and
    Marketing, Education.
    Key Stage 4 Curriculum Booklet
    Technical Award in Sport Studies Exam Board
    Syllabus Number
    OCR
    600/5123/1
    J803/J813
    Aim
    This qualification is designed for learners with an interest in current affairs and sport, topics such as
    the Olympics and barriers to participation. It will provide learners with experience of various team
    and individual sports as well as the opportunity to officiate and lead others. Learners will also cover
    the media and its involvement in sport.
    Grades Available
    Pass / Merit / Distinction / Distinction* at Level 1 and 2
    Outline of the course
    Unit R051 Contemporary issues in sport
    Students explore a range of topical and contemporary issues in sport, such as participation levels
    and barriers, promoting values and ethical behaviour, and how sport contributes to society as a
    whole beyond simply providing entertainment.
    Unit R052 Developing sports skills
    Students try out a range of sports-related skills and techniques, including different practice methods
    for improving both their own performance and that of others. They develop their knowledge of the
    use of tactics and strategies in both individual and team sporting activities as well as their
    understanding of the rules, enabling them to carry out a number of officiating roles within the
    activities.
    Unit R053 Sports leadership
    Students learn about some of the knowledge, understanding and practical skills required to be an
    effective sport leader. They put their knowledge into practice by planning and delivering safe and
    effective sporting activity sessions. Afterwards they review their performance.
    Unit R054 Sport and the media
    Students explore the relationship between sports and the media: how sport uses the media to
    promote itself and the media uses sport to expand and maintain uptake of its products. They look
    at the differences in sports coverage across a range of media outlets and over time and the effect
    that media has had on public interest and involvement in sport.
    Examinations and Assessment
    25% Exam (contemporary issues in sport)
    25% Sport and the media (assessed through controlled assessment work, classroom and computer
    based)
    25% Developing sports skills (physical assessment in 3 sports)
    25% Sports leadership (assessed through teacher observation and self-reflection)
    Further Study
    This course can lead to a variety of further study options and career paths. After studying this
    course, learners will have the foundation knowledge required to consider industry work, vocational
    qualifications or coaching roles.
    In relation to careers, this course is suited to a broad spectrum of jobs in the arena of nutrition,
    coaching, fitness industry, physiotherapy, sports journalism, outdoor pursuits and many more.
    Key Stage 4 Curriculum Booklet
    Biology, Chemistry, Physics
    (Separate Sciences)
    Exam Board
    Syllabus Number
    Edexcel
    1BIO, 1CHO,1PHO
    Aim
    The course aims to inspire, challenge and motivate students by a broad, in depth and coherent
    study. Students develop their curiosity about the world around them allowing them to experience
    how science works across all three disciplines. Due to the academically demanding nature of this
    course, this is a ‘guided’ option. A students’ level of attainment and their commitment to science will
    be used to determine their suitability for the qualification.
    Grades Available
    4-9 Higher Tier
    1-5 Foundation Tier
    Outline of the Course
    Students are awarded 3 separate GCSEs in Biology, Chemistry and Physics. In order to complete the
    three subjects, students need to use one of their option choices in addition to the compulsory
    science time all students have.
    All GCSE Science courses are now linear in nature, meaning that all examinations will be terminal.
    This means that students will be examined at the end of their studies in Year 11.
    Every student studying the separate sciences will cover the same base content as students covering
    the Combined Science course (see earlier pages), however in the separate sciences students cover
    the topics in more depth; deepening their conceptual understanding of each of the scientific
    disciplines. They will also cover additional and more academically challenging material.
    Examinations and Assessment
    GCSE Chemistry External Assessment 100% 2 x 100 mark written examinations
    GCSE Biology External Assessment 100% 2 x 100 mark written examinations
    GCSE Physics External Assessment 100% 2 x 100 mark written examinations
    Practical skills are also assessed through these written examinations.
    Further Study
    GCSE Biology, Chemistry and Physics provide the best foundation for studying A-Level Sciences.
    Career opportunities from studying the three Sciences are highly varied from Medicine and Dentistry
    to Engineering and Architecture as well as the less obvious links with careers in Law and Business. "},
    {"https://www.bodmincollege.co.uk","Computer Science
    GCSE
    Course Outline
    Employees with Computer Science based skills are highly
    sought after in industry and are in short supply. There are
    many ways of accessing technical careers including
    apprenticeships and more traditional academic routes.
    Sixth Form Course
    A level Computer Science will stretch your programming
    abilities and enhance your computational thinking skills in
    conjunction with building up a deeper understanding of the
    underlying concepts.
    YOU WILL DO WELL ON THIS COURSE IF...
    You enjoy solving puzzles and are an independent thinker who is capable of working as an individual or as
    part of a team. You should also have an enquiring mind combined with good English and you must be
    predicted to achieve at least Level 5 in Maths.
    HOW IS THE COURSE ASSESSED?
    Unit 1 - Computer Systems - 100% Examination - Two 90 minute written paper examining students’
    knowledge of computer systems.
    Unit 1 –Computer Systems – 50%. The paper includes short and long answer questions covering the
    physical elements of computer science such as computer hardware, wired and wireless networks, system
    security and software. The paper also covers the social, legal and environmental effects of computer
    systems.
    Unit 2 - Computational thinking, algorithms and programming - 50%. - A 90 minute exam testing students’
    knowledge of program design and creation. The paper covers data representation in computer systems,
    logical problem solving and high and low level programming.
    COURSE OUTLINE
    The course provides students with a real, in-depth understanding of how computer technology works.
    Students will no doubt be familiar with the use of computers and other related technology from their
    Computer Science lessons and elsewhere. However, the course will give them an insight into what goes on
    ‘behind the scenes’. There is an emphasis on computer programming using the Python programming
    language, and computational thinking which will equip students with the necessary skills required to
    succeed in many other areas. These skills include independent learning, problem solving and the ability to
    think creatively, innovatively and logically to design and program solutions to real-world problems.
    Students will investigate the components that make up digital systems and how they communicate with
    one another and with other systems, they will also develop an understanding of the impacts of digital
    technology to the individual and to wider society."},
    {"http://www.debenhamhighschool.suffolk.sch.uk/","This course encourages learners to:
     understand and apply the fundamental principles and concepts of Computer Science, including abstraction,
    decomposition, logic, algorithms and data representation
     analyse problems in computational terms through practical experience of solving such problems, including
    designing, writing and debugging programs
     think creatively, innovatively, analytically, logically and critically
     understand the components that make up digital systems, and how they communicate with one another
    and with other systems
     understand the impacts of digital technology to the individual and to wider society
     apply mathematical skills relevant to Computer Science.
    Overview:
    Unit 1 Computer Systems
    This component will introduce learners to the Central Processing Unit (CPU), computer memory and storage, wired
    and wireless networks, network topologies, system security and system software. It is expected that learners will
    become familiar with the impact of Computer Science in a global context through the study of the ethical, legal,
    cultural and environmental concerns associated with Computer Science.
    Unit 2 Computational Thinking, Algorithms and Programming
    This component incorporates and builds on the knowledge and understanding gained in unit 1, encouraging
    learners to apply this knowledge and understanding using computational thinking. Learners will be introduced to
    algorithms and programming, learning about programming techniques, how to produce robust programs,
    computational logic, translators and facilities of computing languages and data representation. Learners will
    become familiar with computing related mathematics.
    Assessment:
    Unit 1 - 50% of GCSE, Exam in Year 11, 80 marks, 1.5 hours
    Unit 2 - 50% of GCSE, Exam in Year 11, 80 marks, 1.5 hours
    Why choose this subject?
     It gives an excellent opportunity to investigate
    how computers work and how they are used
     It enables you to develop your critical thinking
    and problem-solving skills which can be
    transferred to everyday life
     It will give you a real advantage in today’s
    technology driven world. You will make the
    leap from using other people’s software to
    being able to design and create your own.
    What can you do next with this subject?
     A level Computing
     Excellent preparation if you want to study or work in
    areas that rely on the skills you’ll develop, especially
    when they are applied to technical problems. These
    areas include engineering, financial and resource
    management, science and medicine
     Popular jobs for computer scientists: computer
    programmer, software developer, network engineer,
    web developer, database administrator, systems analyst
    etc."},
    {"http://www.brighouse.calderdale.sch.uk/curriculum/","Course Outline
    The Computer Science GCSE course is only available as part of the STEM package (which also includes
    triple science, a humanity and a language).
    Our GCSE in Computer Science is engaging and practical, encouraging creativity and problem solving. It
    encourages students to develop their understanding and application of the core concepts in computer
    science. The world depends on computers. In this GCSE you will learn how computers work, the
    networks they use and how programming can create solutions to everyday problems and future
    challenges. Computer Science combined with other subjects can open up a whole world of
    opportunities.
    Key Features
    1. Component 01: Computer systems introduces students to the central processing unit (CPU),
    computer memory and storage, data representation, wired and wireless networks, network
    topologies, system security and system software. It also looks at ethical, legal, cultural and
    environmental concerns associated with computer science.
    2. Component 2: Computational thinking, algorithms and programming Students apply
    knowledge and understanding gained in component 01. They develop skills and understanding
    in computational thinking: algorithms, programming techniques, producing robust programs,
    computational logic and translators.
    3. Practical programming: Students are to be given the opportunity to undertake a programming
    task during their course of study which allows them to develop their skills to design, write, test
    and refine programs using a high-level programming language e.g. Python.
    Assessment
     Computer systems written exam 80 marks (1.5 hours, 50% weighting)
     Computational thinking, algorithms and programming written exam 80 Marks (1.5 hours, 50%
    weighting)
     Practical programming
    Progression
    Students at BHS beginning a GCSE (9–1) in Computer Science course have followed a Key Stage 3
    programme of study and no additional subject knowledge is required. Having a computing qualification
    will provide you with the knowledge, problem-solving skills and logical thinking capabilities that serve
    as a competitive advantage in your career. Every industry uses computers, meaning computer
    scientists are important to every sector. This is a qualification that enables students to progress to A
    Level Computer Science or ICT qualifications.
    For more information please contact – Mr Wall
    "},
    {"https://www.walton-ac.org.uk/","This carefully planned course gives students a real, in-depth understanding of how computer technology works. It offers an insight into what goes on ‘behind the scenes’, including computer programming, which many students find absorbing. Through this qualification, students will develop their understanding of current and emerging technologies and how they work, look at the use of algorithms in computer programs, become independent and discerning users of IT, acquire and apply creative and technical skills, knowledge and understanding of IT in a range of contexts, develop computer programs to solve problems, evaluate the effectiveness of computer programs / solutions and the impact of computer technology in society.

    Specification Content
    
    The aims and objectives of this qualification are to enable students to:
    
        Understand and apply the fundamental principles and concepts of computer science, including abstraction, decomposition, logic, algorithms, and data representation
        Analyse problems in computational terms through practical experience of solving such problems, including designing, writing and debugging programs
        Think creatively, innovatively, analytically, logically and critically
        Understand the components that make up digital systems, and how they communicate with one another and with other systems
        Understand the impacts of digital technology to the individual and to wider society
        Apply mathematical skills relevant to computer science.
    
    Awarding Body
    
    Edexcel https://qualifications.pearson.com/en/qualifications/edexcel-gcses/computer-science-2016.html
    
    Assessment
    
    Assessment will consist of two externally-examined papers and a non-examined assessment component. Students must complete the non-examined component in March and all external assessments in May/June in any single year.
    
        Component 1 Principles of Computer Science Written examination 1hr 40 mins 40%
        Component 2 Application of Computational Thinking Written examination 2 hrs 40%
        Component 3 Computer Science Project Controlled Assessment 20 hrs 20%
    
    Topics covered
    
        Problem Solving
        Programming
        Data
        Computer hardware and software
        Communications and Networks
        The Internet and the Bigger Picture
    
    Recommended revision guides / course resources Revise Edexcel GCSE 9-1 Computer Science Revision Guide by Pearson Education Online resources
    
        www.python.org
        www.bbc.co.uk/schools/gcsebitesize/ict/
    "},
    {"http://www.castlefordacademy.com","Aim:
    • To provide you with an in-depth understanding of how computer technology works
    and a look at what goes on behind the scenes.
    • The course will help you learn about critical thinking, analysis and problem
    solving.
    • Computer systems and theory of Computer Science.
    • Systems development in a suitable programming language.
    What makes GCSE Computer Science a good choice for you?
    Enjoy being challenged? Like pushing yourself to learn new things? Enjoy difficult
    tasks? Enjoy Maths and science? Computer science offers you the opportunities to
    do all these and gain an understanding of the way computers work, create and review
    computer programs for real life purposes based on your own interests.
    It encourages you to create your own applications and other systems, rather than
    simply use those designed by others. Every wonder how a computer actually works?
    Well doing this course will help you start to understand how.
    Where will it take me?
    This is an excellent course to lead into Computing A-level and University. This is also
    an excellent qualification to help you move into any technical/problem solving area
    at many levels. These areas include engineering, science, medicine, financial and
    resource management etc.
    What will I learn?
    Computer Science requires you to demonstrate the ability to:
    • Think creatively, innovatively, analytically, algorithmically, logically and critically.
    • Show that you can follow a brief to meet requirements.
    • Use computational thinking to design, create and develop your own programming
    solution to a problem.
    • Use abstraction to model, decompose and generalise.
    • Detect errors in computer programs and correct them.
    • Manipulate data, sequence instructions, test designs and explore ideas.
    • Adopt safe, secure and responsible practice when using computers.
    • Evaluate and improve systems you create as well as those of others.
    Exam
    100%
    How will I learn?
    You will have lessons where you will program using Python, combined with theory /
    research lessons. Lessons will be both hands-on and also paper based. Lessons will
    be varied with frequent peer and self-assessment, retrieval practice and low-stakes
    testing. You will need to be able to learn, retain and recall keywords for the subject.
    What Homework can I expect?
    To develop examination techniques homework will be set frequently to cover the
    examined unit. As well as paper-based and online programming challenges, if you
    don’t have internet at home you can use classrooms afterschool.
    Additional Requirements
    A good understanding of Maths is beneficial. Good resilience and staying power
    required. Currently there are two parts to the course: There will be a 1.5hour paper
    based exam worth 50% of the qualification and a 2 hour onscreen examination where
    you will use a computer to complete Python programs. For more information please
    see: https://qualifications.pearson.com/content/dam/pdf/GCSE/Computer%20
    Science/2020/specification-and-sample-assessments/GCSE_L1_L2_Computer_
    Science_2020_Specification.pdf"},
    {"http://www.stourvalleycommunityschool.org/","OCR GCSE Computing

    OCR GCSE Computing takes students a long way into understanding how to solve problems by using computers. At the heart is the understanding of algorithms and how to write computer programs based on well planned algorithms. OCR GCSE is divided into 3 units:
    Unit A451:
    
    Computer systems and programming 40% of the overall GCSE grade.This unit covers the knowledge that underpins the specification. It includes the basic principles behind computer science and some important practical aspects.
    Fundamentals of computer systems
    
    This topic introduces computer systems and provides a foundation for the remaining topics in this unit. Students will learn that the term ëComputer Systemí does not just mean the desktop at home but can include any system controlled or including a processor.
    Computing hardware
    
    Students will be able to define the term hardware and have an understanding of many different types and how they operate.
    Software
    
    Students will be able to define the term software and have an understanding of the types and how they interact with the user and hardware.
    Representation of data in computer systems
    
    Students will understand how data is stored on a computer system and the different ways they can be represented.
    Databases
    
    Students will be able to understand, operate and create databases.
    Computer communications and networking
    
    Students will learn about the setup and structure of networks and the Internet.
    Programming
    
    Students will gain an understanding of how programming languages operate.
    Unit A452:
    
    Practical Investigation is worth 30% of the overall GCSE grade.
    
    This is a controlled assessment that involves the students carrying out a practical investigation.
    
    This unit is designed to provide candidates with an opportunity to carry out a practical investigation into a computing issue and engage them with computing in the real world.
    
    The unit deliberately extends the candidateís work beyond the topics in Unit A451 in order to provide a stimulating experience.
    
    Candidates will be expected to produce a report which will then be assessed under the four headings:
    
        Practical activity
        Effectiveness and efficiency of the solution
        Technical understanding
        Testing, evaluation, judgements and conclusions
    
    Unit A453:
    
    Programming project is worth 30% of the overall GCSE grade.
    
    This unit will require the student to solve a specific problem by writing program code in the python programming language.
    
    Programming tasks set by OCR that enable candidates to design, develop and test a solution to a problem.
    
    OCR will issue a range of practical assessment tasks each consisting of up to three sub-tasks.
    
    Students will need to create suitable algorithms which will provide a solution to the stated problem then code their solutions in a suitable programming language.
    
    The solutions must be tested at each stage to ensure they solve the stated problem using a suitable test plan with appropriate test data. The code must be suitably annotated to describe the process. Test results should be annotated to show how these relate to the code, the test plan and the original problem.
    
    Students will need to provide an evaluation of their solution based on the test evidence."},
    {"https://www.thehoward.org/","Why study Computer Science?
    This is a course that has real relevance in our modern world. Whilst you will no doubt
    already have some knowledge of computers and related areas, the course will give you an
    in-depth understanding of how computer technology works and a look at what goes on
    ‘behind the scenes’. As part of this, you will investigate computer programming, which
    many find interesting.
    Information technologies continue to have a growing importance. This means there will
    be a bigger demand for professionals who are qualified in this area. If you want to go on
    to higher study and employment in the field of Computer Science, you will find that this
    course provides a superb stepping stone.
    The course will cover
    You will learn about the fundamentals of computers including hardware and software.
    You will develop your understanding of current and emerging technologies.
    For the practical elements of the course, you will learn technical skills, programming
    (Python) and gain an understanding of the use of algorithms in computer programs.
    The aim will be that you can then solve problems using programming and develop
    computer programs.
    This course has a high maths content."},
    {"https://www.astrea-longsands.org/","GCSE Computer Science is an academically challenging
    course which suits students who enjoy science and
    have good mathematical ability. Students completing
    this course will be equipped with the logical and
    computational skills necessary to succeed at A Level (or
    equivalent), the workplace or beyond.
    This is a course that has real relevance in our modern
    world. While students will no doubt already have some
    knowledge of computers and related areas, the course
    will give them an in-depth understanding of how
    computer technology works and a look at what goes on
    ‘behind the scenes’.
    As part of this, they will investigate computer
    programming, which many students find interesting.
    Through this study of computer programming, the
    course will help students develop critical thinking,
    analysis and problem-solving skills.
    For many, it will be a fun and interesting way to develop
    these skills, which can be transferred to other subjects
    and even applied in day-to-day life.
    In this way, the course will stimulate interest and
    engagement with technology and technology-related
    careers."},
    {"http://www.bungayhigh.co.uk","Why study Creative iMedia?
    Digital Created Content has taken over the world by storm; we see them daily, and it’s all around us.
    Website, movies, adverts and mobile apps affect our daily lives. Learning how they are created and why we
    create them has become an essential part of the digital future. Studying Creative iMedia introduces you to
    just that and beyond!
    What is Creative iMedia about?
    Creative iMedia is a media-focused hands-on course with IT at its heart. The course provides knowledge in
    a number of key areas in this field from pre-production skills to digital production (animation,
    photography, film, television, web development, and animation).
    The Creative iMedia course introduces you to how the media and entertainment industry works. Topics
    include learning how to create professional projects from scratch to understanding the law and rules
    surrounding digital media.
    What pathways does this subject open up after Year 11?
    The skills and programs you’ll be taught in this course are industrial standard. This will give you an
    advantage over other courses if you are interested in taking this as a career. Creative IMedia is aimed at
    students whom are interested in entertainment and media industry. These include: Writers and Authors,
    Multimedia Artists and Animators, Art Directors, Photographers, and Graphic Designers.
    How will you be assessed?
    Over the 2 years, you are required to complete:
    3 Controlled Assessment Modules (collectively 75% of the grade)
    1 Written Exam (25% of the grade)
    Who is the contact in school for more information?
    Mr M Cubitt – Head of ICT (mcubitt@bungayhigh.co.uk)
    "},
    {"http://minsthorpe.cc","What is included in the course?
    The subject content is divided into six topics:
    1. Problem solving - Students will develop their
    computational thinking skills which will enable
    them to understand how computer systems
    work, and design and create algorithms to solve
    problems
    2. Programming - Students will become
    competent at designing, reading, writing and
    debugging computer programs and be given
    lots of opportunities to develop and practise
    their programming skills throughout the course
    3. Data - This topic covers binary representation
    of data, data compression, encryption and data
    storage in databases
    4. Computers - This is concerned with the
    hardware and software components of a
    computer system
    5. Communication and the Internet - This
    topic is about networks, network and cyber-
    security and the Internet and WWW
    How will I be assessed?
    Instead of having just one written paper
    covering all six topics, this new course has
    two papers - one focusing on principles
    of computer science and the other on
    computational thinking - each has a 40%
    weighting. The other 20% is made up of one
    substantial project, in which students must
    analyse a problem and design, implement,
    test, refine and evaluate a solution. This Non-
    Examined Assessment (NEA) will take 20
    hours to complete. This will be undertaken in
    Term 1 of Year 11.
    What grades are available?
    This is a Level 2 course in which you will work
    towards one GCSE, grades 1-9.
    Possible next steps
    Further Study - This course would be a good
    preparation for students wanting to study
    Computing at Post 16, it would be a good
    pathway on to the A Level.
    Minimum requirements
    • A minimum target grade of 5 in Maths
    • A minimum score of 60% on your CDM exam
    If a student does not meet this criteria, but wishes
    to study Computing at Key Stage 4, please contact
    Mr Mallinson to discuss further.
    Skills Developed
    • Analytical skills- Being a computer science major
    involves identifying a problem and coming up
    with a technological solution to address it
    • Problem-solving skills
    • Creativity
    • Critical-thinking skills
    • Resilience
    Career Opportunities
    • Application analyst
    • Applications developer
    • Data analyst
    • Database administrator
    • Games developer
    • Information systems manager
    • IT consultant
    • Multimedia programmer"},
    {"https://www.williamhoward.cumbria.sch.uk/","What will I learn?
    The elements of the course are:
    1. Systems architecture
    2. Memory and storage
    3. Computer networks, connections & protocols
    4. Network security
    5. Systems software
    6. Ethical, legal, cultural & environmental impacts of digital technology
    7. Algorithms
    8. Programming fundamentals
    9. Producing robust programs
    10. Boolean logic
    11. Programming languages & Integrated Development Environments
    The course is a mixture of theory (so students understand the enduring principles, relevant mathematical skills
    and abstract concepts of Computer Science) and computational thinking and practice (so students learn how to
    solve problems, write efficient code and build working systems). It provides opportunities for students to explore
    the wider societal and ethical issues associated with Computer Science and to develop as responsible
    practitioners.
    What about exams?
    As with all GCSE qualifications, the external assessment is by formal, end of course examination.
    There are two written exam papers, or Components, in this subject, each lasting 90 minutes. Component 01:
    Computer systems Introduces students to the central processing unit (CPU), computer memory and storage, data
    representation, wired and wireless networks, network topologies, system security and system software. It also
    looks at ethical, legal, cultural and environmental concerns associated with computer science. Component 02:
    Computational thinking, algorithms and programming, asks that students apply knowledge and understanding
    gained in component 01. They develop skills and understanding in computational thinking: algorithms,
    programming techniques, producing robust programs, computational logic and translators.
    What’s the difference between Computer Science and IT?
    IT and Computer Science are two distinct subjects, with different aims and objectives. You need to decide
    whether you want to be better at using the computers to achieve a specific design or communication task, in
    which case you would be better suited to IT, or better at the technical elements of computer function and control,
    in which case this is the course for you.
    Do I need a computer at home?
    No – but you will need to be prepared to put in an equal amount of time outside lessons as in class to make sure
    you understand the theory and can apply it in practice. Coursework notes are kept in your own exercise book and
    on a number of online classroom environments so you can refer to your experiences throughout your studies to
    help you learn what you need.
    Can I go on to A Level?
    Yes – this course leads directly into the A Level"},
    {"http://www.wymondhamhigh.co.uk","Computer Science is all about learning
    what happens inside computer systems.
    Students will learn about the components
    that make up a computer system, how to
    break problems down into manageable
    chunks, to problem solve, to think
    creatively and innovatively, and program
    a computer system. Students will
    acquire the skills to design, write and test
    computer programmes using Python and
    other programming languages, as well
    as look at the development of computer
    technology and the effects it has had on
    the world around us.
    Course structure
    In Year 9, students learn the fundamental
    concepts of computer coding using
    Python. Students complete different
    assignments that build their programming
    skills and understanding. Students also
    use pseudocode and flow diagrams to
    solve problems, enter local competitions
    for complex scratch gaming and learn to
    program robots.
    In Years 10 and 11 students’ programming
    skills are further developed and they also
    cover the theory behind computing for the
    2 examinations.
    Skills and knowledge you will need
    Computing is a more specialist course than
    ICT and students must have the ability to
    think logically and have a good knowledge
    of mathematics. This course would suit
    students who are targeted at least a
    pathway 6 in Mathematics at GCSE.
    Assessment
    Unit 1 Computer Systems:
    50% of the marks (written paper).
    Covers theory on topics including: hardware,
    software, networks, system security,
    communication and ethics in computing.
    Unit 2 Computational Thinking:
    50% of the marks (written paper).
    Covers programming concepts such as
    variables, data types, arrays, file handling,
    sub programs, testing, translators, binary,
    hexadecimal and compression.
    Progression
    Students who enjoy Computing at GCSE
    can progress to study A Level or other Level
    3 Computing courses. At university there
    is a wide range of computer based degrees
    with options to specialise in areas of
    particular interest.
    There is a serious skills shortage in the
    UK and globally of people who can write
    computer code. There are a wide variety
    of lucrative careers involving computing
    for those with a passion for the subject
    and a willingness to keep learning. In fact,
    the growth and evolution of new technologies
    means in the future there will be lots of jobs
    that require computing skills that we have
    not even thought about yet! Computing is
    a subject that could awaken a passion that
    could lead anywhere and last a lifetime.
    Specification
    Awarding Body and Specification
    OCR Computing GCSE — Code J277"},
    {"https://www.gumleyhouse.com","THE GENERAL AIMS OF THE COURSE:
    This GCSE encourages you to explore how computers work and communicate. You will carry out practical tasks that
    will develop your imaginative, innovative thinking, creativity and independence.
    You will also develop the skills of design and evaluation, and how to test and problem-solve when errors occur. You
    will learn how to create games, apps and systems, rather than using programmes designed by others.
    WHY CHOOSE GCSE COMPUTER SCIENCE
    Try to imagine a world without computers. There would be no PCs or laptops, no using the web, no mobile phones or
    digital cameras, because these are computers at heart. Computer science teaches you how to use computers to make the
    world work as it does. Computing is of enormous importance to the economy. The growth in the use of mobile devices
    and web-related technologies has led to jobs in these industries and a shortage of skills.
    This qualification will give you an understanding of key computing concepts and programming. Computer science is also
    about people, solving puzzles, creativity, changing the future and, most of all, having fun.
    What could the GCSE lead to?
    SPECIFICATION AT A GLANCE
     Computer systems and computer hardware, you will be able to make decisions about hardware,
    software, storage, memory.
     Computer networking and how the Internet and other communication networks work.
     Using algorithms i.e. telling the computer, step by step, exactly what you want it to do.
     Understanding of and use of programming, you will learn a programming language.
     Understanding current technologies and the trends towards the future of computing.
     The digital age, understanding the legal, social, economic, ethical and environmental issues that
    arise in this digital age.
     Database concepts, learning about searching data using query methods such as SQL.
     How you can connect to databases from other applications and web based apps.
     The use of computer technology in society today.
    COMPUTER SCIENCE
    22
    GCSE Computer Science gives a thorough grounding in computing and will create opportunities for you to move on to A-
    levels, vocational courses, industry recognised IT qualifications. You can also find employment as you will have computing
    skills that are needed in the workplace.
    GCSE Computer Science also supports progress in other areas such as technology, science, engineering and the creative
    industries. If you choose not to study Computer Science at a higher level than GCSE the course will still benefit you
    because so many jobs in the current climate involve using the skills you will learn over the course.
    Paper Mode of Assessment
    Paper 1 – Computer Systems
    Questions to test knowledge and understanding of the
    central processing unit (CPU), computer memory and
    storage, wired and wireless networks, network
    topologies, system security and system software. It also
    looks at ethical, legal, cultural and environmental
    concerns associated with computer science.
    Written exam:
    1 hour 30 minutes
    80 marks
    40% of GCSE
    Paper 2 – Written assessment
    Questions to test skills and understanding in
    computational thinking: algorithms, programming
    techniques, producing robust programs, computational
    logic, translators and data representation.
    The skills and knowledge developed within this
    component will support the learner when completing the
    component 03 programming project.
    Written exam set in practically based scenarios:
    1 hour 30 minutes
    80 marks
    40% of GCSE
    Unit 3: Non Exam Assessment
    The non-exam assessment (NEA) assesses a student's
    ability to use the knowledge and skills gained through
    the course to solve a practical programming problem.
    Students will be expected to follow a systematic
    approach to problem solving.
    Controlled Assessment
    20 hours 20% of the marks
    What kind of student is suitable for the course?
    Students must have an interest computing and be prepared for learn programming techniques. Students will need to be
    good at communicating and explaining their ideas.
    Careers
    GCSE Computer Science can lead you to many other career paths, for
    example it supports progress in careers in technology, science, engineering
    and the creative industries. These are areas where there is a shortage of
    skilled people. If you choose not to study Computer Science at a higher
    level that GCSE the course will still benefit you because so many jobs in
    the current climate involve using the skills you will learn over the course.
    Extra-Curricular activities
    These will include visits to and from industry and software develo"},
    {"https://www.manningtreehigh.com","Why should I take it?
    This exciting GCSE gives you an excellent opportunity to investigate how
    computers work and how they’re used, and to develop computer programming
    and problem-solving skills. You’ll also do some fascinating in-depth research and
    practical work, both of which will help in a variety of different real-world
    scenarios. If you have any interest in technological development, application
    developments, and in general programming, then this is the course for you.
    What will I be studying?
    ● Understand and apply the fundamental principles and concepts of
    Computer Science, including abstraction, decomposition, logic,
    algorithms, and data representation.
    ● Analyse problems in computational terms through practical experience of
    solving such problems, including designing, writing, and debugging
    programs.
    ● Think creatively, innovatively, analytically, logically and critically.
    ● Apply mathematical skills relevant to Computer Science.
    ● Understand the components that make up digital systems, and how they
    communicate with one another and with other systems.
    ● Understand the impacts of digital technology to the individual and to
    wider society.
    34
    The new specification of J277:
    J277/01: Computer Systems
    ● System Architecture
    ● Memory and Storage
    ● Computer networks, connections and protocol
    ● Network security
    ● System software
    ● Ethical, legal, cultural and environmental impacts of digital technology
    J277/02: Computational thinking, algorithms and programming
    ● Algorithms
    ● Programming fundamentals
    ● Producing robust programs
    ● Boolean Logic
    ● Programming languages and Integrated Development Environments
    How is it assessed?
    Computer systems
    80 marks
    1 hour and 30 minutes
    Written paper
    (no calculators allowed)
    50% of total GCSE
    Computational thinking,
    algorithms and
    programming
    80 marks
    1 hour and 30 minutes
    Written paper
    (no calculators
    allowed)
    50% of total GCSE
    Practical Programming
    All students are given the opportunity to undertake a programming task, either
    to a specification or to solve a problem, during their course of study. Students
    may draw on some of the content in both components when engaged in
    practical programming.
    What else do I need to know?
    35
    To confidently succeed in computer science you should have a keen interest in
    coding, decent grasp of mathematics and an understanding of Technology"},
    {"https://www.braunton.academy","In this day and age computing actually makes up a large
    percentage of our daily lives. Our communication with friends, our businesses, our
    entertainment, our travel is all controlled using computers. Choosing this modern subject
    will give you a greater understanding of how our world intertwines with technology and
    how that technology works to make everyday life easier for us.
    As part of the course you will:
    • Understand the inner workings of computer systems
    • Look at the fundamental algorithms we use in everyday life
    • Learn about cyber security in an increasingly hackable world
    • Develop knowledge of computing programming to solve problems
    • Learn about the environmental and social impact of computers
    Method of Assessment:
    NEA on coding a solution to a computer problem — ‘The Programming Problem’
    Computational thinking and problem solving examination.
    Written assessment on theoretical knowledge of computing.
    Students will complete two examinations at the end of the course worth 50% each.
    Future Study and Careers:
    Students can go on to study A-Level Computing at Petroc or similar colleges. At university,
    students could chose to study a broad range of computing subjects including; Network
    Management, Cyber-Security and Forensics, Video Game development, Digital Graphics,
    and Systems Analyst.
    Our Students Say...
    “Computer Science has given me many practical programming skills that I am now able
    to apply in a real world scenario.”
    “It’s always interesting and great fun. It can be used later on in life if you want to become
    a programmer.”
    “Computer Science is good as you learn a large amount about computers and how to
    code. It’s challenging and requires determination"}
]